{
  "backend/main.mo": "Actor defines user profile types, check-in data structures, and brutal feedback messages with authorization mixin.",
  "feature_evidence.json": "Report linking dashboard graph removal feature to affected frontend file and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of various frontend components and pages.",
  "frontend/index.css": "Empty stylesheet placeholder with no content.",
  "frontend/index.html": "Base HTML shell configuring metadata, icons, and loading the main React entry point.",
  "frontend/src/App.tsx": "Root component handling auth flow, actor initialization, status loading, and routing to login, onboarding, or dashboard.",
  "frontend/src/components/BrutalFriendDialog.tsx": "Controlled dialog showing backend or fallback brutal feedback messages with close handling.",
  "frontend/src/components/BrutalFriendFeedbackCard.tsx": "Card that fetches and displays the latest brutal feedback with loading and error states.",
  "frontend/src/components/ChanceOfDrinkingCard.tsx": "Card showing a placeholder randomly generated risk level with color‑coded styling.",
  "frontend/src/components/CycleWindowCard.tsx": "Computes days until Friday and the next full moon and displays themed messages in a card component.",
  "frontend/src/components/DailyCheckInDialog.tsx": "Dialog for daily sobriety, drink count, and mood input with validation and submission handling.",
  "frontend/src/components/DataLoggedDialog.tsx": "Simple dialog showing a confirmation message after data is logged or updated.",
  "frontend/src/components/DrinksChart.tsx": "Builds a 14‑day drinks history bar chart with update animation and loading states.",
  "frontend/src/components/FollowUpCheckInDialog.tsx": "Dialog for follow‑up check‑ins, asking if more drinks were had and optionally collecting a count.",
  "frontend/src/components/GlobalErrorBoundary.tsx": "Error boundary that displays an error screen with reload option and optional details.",
  "frontend/src/components/Header.tsx": "Top navigation bar with branding and a logout button.",
  "frontend/src/components/MoodIndicator.tsx": "Shows the most recent mood metric with an emoji and styled label.",
  "frontend/src/components/MotivationButton.tsx": "Button that fetches a motivation message, tracks remaining clicks, and opens a dialog to display the result.",
  "frontend/src/components/OnboardingFlow.tsx": "Multi-step onboarding questionnaire that saves user profile data and auto-advances through predefined questions.",
  "frontend/src/components/ProgressStats.tsx": "Displays sober days, streak, total tracked days, and drunk days using fetched progress metrics.",
  "frontend/src/components/RepeatCheckInDialog.tsx": "Dialog for repeated daily check-ins that asks if the user is still sober or how many drinks they had.",
  "frontend/src/components/SoberDaysSection.tsx": "Shows sober streak and target progress with large visual counters.",
  "frontend/src/components/StatusIndicatorsSection.tsx": "Computes and displays status summaries for today, yesterday, and weekly average based on aggregated entries.",
  "frontend/src/components/UnifiedHeaderSection.tsx": "Header combining latest feedback display and a motivation button with rate limiting.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages the backend actor based on identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, managing identity loading, login, logout, and status flags. Wraps AuthClient creation and exposes a hook for consuming authentication state.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating backend data such as onboarding status, user profiles, and check-ins, with retry logic and cache invalidation. Relies on an actor from useActor to call backend methods.",
  "frontend/src/index.css": "Sets global Tailwind and OKLCH-based BRUTAL theme styles, including colors, typography, neon effects, and utility classes. Defines base styling, dark mode variables, animations, and layout safeguards.",
  "frontend/src/main.tsx": "Bootstraps the React app by creating the root, wiring QueryClientProvider and InternetIdentityProvider, and rendering App. Imports global CSS and initializes a QueryClient.",
  "frontend/src/pages/Dashboard.tsx": "Implements the main logged-in dashboard, wiring identity, user data queries, check-in flows, and session logic into UI components. Coordinates auto-starting session flows and renders multiple metric and dialog components.",
  "frontend/src/pages/LoginPage.tsx": "Renders the login screen with branding, animations, and a button triggering Internet Identity login. Preloads the logo and shows a loading state during authentication.",
  "frontend/src/session/dailySessionFlow.ts": "Implements a deterministic session-flow state machine for onboarding and check-in modals, including phase resolution, modal queue generation, and state transitions.",
  "frontend/src/utils/sobrietyDuration.ts": "Parses human-readable sobriety duration text into a day count with simple pattern checks and a 30‑day fallback.",
  "frontend/src/utils/urlParams.ts": "Provides utilities to read URL parameters, persist them in sessionStorage, and clean sensitive params from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, shadows, keyframes, and container settings with custom theme tokens.",
  "project_state.json": "Describes the project’s current feature set, architecture, and state version for a React + Motoko sobriety tracking app."
}