{
  "backend/main.mo": "Motoko canister implementing the core backend logic: user profiles, onboarding, daily check-ins, aggregation, and authorization, plus an admin-managed feedback matrix used to generate personalized feedback messages.",
  "feature_evidence.json": "Machine-readable feature evidence report describing frontend-only features for a Feedback Matrix Inspector, including related files, dependencies, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten high-level summaries of key frontend source files, covering app structure, hooks, pages, components, styling, and their roles in the BRUTAL sobriety-tracking UI.",
  "frontend/index.css": "Global Tailwind CSS base defining BRUTAL brand design tokens, light/dark theme variables, chart colors, and foundational styling rules.",
  "frontend/index.html": "HTML entry point setting up metadata, social previews, icons, theme settings, and mounting the React app at the root element.",
  "frontend/public/feedbackMatrix.json": "Static JSON dataset of feedback matrix entries mapping user attributes (age range, motivation, baseline tier, etc.) to brutal-style feedback messages for frontend inspection or fallback use.",
  "frontend/src/App.tsx": "Main React application component handling authentication flow, actor initialization, onboarding vs dashboard routing, error states, and a hidden debug route for the Feedback Matrix Inspector.",
  "frontend/src/components/BrutalFriendDialog.tsx": "Modal dialog that displays a brutally honest feedback message with a skull icon, using a backend-provided message or a random fallback when opened.",
  "frontend/src/components/BrutalFriendFeedbackCard.tsx": "Dashboard card that fetches and displays the latest brutal friend feedback, with loading and empty states.",
  "frontend/src/components/ChanceOfDrinkingCard.tsx": "Card showing a placeholder, randomly generated risk level (Low/Moderate/High) for drinking tomorrow with color-coded styling.",
  "frontend/src/components/CycleWindowCard.tsx": "Card logic for displaying time until Friday and the next full moon with corresponding normal and brutal messages based on date calculations.",
  "frontend/src/components/DailyCheckInDialog.tsx": "Daily check-in modal triggered on first login of the day that collects sobriety, drink count, and mood, submits to backend, and then shows brutal feedback.",
  "frontend/src/components/DrinksChart.tsx": "14-day bar chart of daily drink counts built with Recharts, including loading, syncing, and update animations.",
  "frontend/src/components/FollowUpCheckInDialog.tsx": "Follow-up check-in modal for later logins the same day to record additional drinks or confirm sobriety and show brutal feedback.",
  "frontend/src/components/Header.tsx": "Sticky top navigation header with app branding and a logout button.",
  "frontend/src/components/MoodIndicator.tsx": "File exists but contains no implementation or exported component.",
  "frontend/src/components/MotivationButton.tsx": "Renders a motivation button that fetches a motivation message from the backend with click limits and falls back to a local feedback matrix, showing the result in a dialog.",
  "frontend/src/components/OnboardingFlow.tsx": "Implements a multi-step onboarding questionnaire, derives and maps answers to backend enums, detects timezone, and saves the user profile via backend hooks.",
  "frontend/src/components/ProgressStats.tsx": "This file is empty and currently contains no implementation.",
  "frontend/src/components/SoberDaysSection.tsx": "Displays current sober streak and a dynamic sober-days target fetched from the backend, using provided sobriety metrics.",
  "frontend/src/components/StatusIndicatorsSection.tsx": "Computes and displays status indicators (today, yesterday, weekly average) based on aggregated drinking data with color-coded severity.",
  "frontend/src/components/UnifiedHeaderSection.tsx": "Shows daily feedback from the backend and a motivation button with click limits, opening a dialog to display motivation messages.",
  "frontend/src/hooks/useActor.ts": "Provides a React hook to create and manage an authenticated or anonymous backend actor using React Query, invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Defines a React context, provider, and hook to manage Internet Identity authentication, including login/logout, persisted identities, and detailed login status flags using Dfinity AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating backend data (user profile, onboarding status, check-ins, metrics) via an actor, with retries, caching, and query invalidation.",
  "frontend/src/index.css": "Global Tailwind CSS setup defining a brutalist dark theme with OKLCH color variables, typography, base styles, and custom utility classes for glow effects and animations.",
  "frontend/src/lib/feedbackMatrixLoader.ts": "Loads and caches a feedback matrix from a JSON file, normalizes it to backend types, and provides a search function to select a context-matched feedback message.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app, wrapping it with React Query and Internet Identity providers and importing global styles.",
  "frontend/src/pages/Dashboard.tsx": "Main authenticated dashboard page that composes charts, cards, dialogs, and status sections, handles logout, and displays user progress and check-in data.",
  "frontend/src/pages/FeedbackMatrixInspector.tsx": "Developer-facing page that loads the feedback matrix, groups entries by key attributes, analyzes sentence counts, and renders summary statistics with loading and error states.",
  "frontend/src/pages/LoginPage.tsx": "React login page that displays a branded logo/placeholder, marketing copy, and a single Internet Identity login button with loading state and animations. It preloads the logo for faster render and uses a custom auth hook to trigger login and reflect login status.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading URL parameters from query strings or hash routing, persisting them in sessionStorage, and retrieving or clearing them safely. Supports precedence of URL over session storage and is designed for handling sensitive or routing-related parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration enabling dark mode, custom content paths, and plugins, with extensive theme extensions for colors, shadows, animations, and brutal/neon styling tokens driven by CSS variables. Defines custom keyframes, box shadows, border radii, and container settings for the app’s design system.",
  "project_state.json": "Machine-readable snapshot of the project’s current state, including a high-level product summary and a catalog of implemented features with IDs, descriptions, and versions. Used to track functional scope such as authentication, access control, onboarding, and daily check-ins."
}