{
  "backend/main.mo": "Defines user profile types, check-in structures, feedback messages, and applies access control with authorization mixin.",
  "feature_evidence.json": "Feature evidence report mapping two dashboard flow features to affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "List of summarized frontend file purposes including components, pages, hooks, and styling.",
  "frontend/index.css": "Empty stylesheet placeholder for global frontend styles.",
  "frontend/index.html": "HTML entry point setting metadata, icons, and root app mount with script loader.",
  "frontend/src/App.tsx": "Root React component handling authentication, actor initialization, fallbacks, and routing to login, onboarding, or dashboard.",
  "frontend/src/components/BrutalFriendDialog.tsx": "Dialog component that displays backend or fallback brutal messages with external open/close control.",
  "frontend/src/components/BrutalFriendFeedbackCard.tsx": "Card that fetches and displays the latest brutal friend feedback with loading and error states.",
  "frontend/src/components/ChanceOfDrinkingCard.tsx": "Card showing a placeholder randomized risk level with stylized brutal theme.",
  "frontend/src/components/CycleWindowCard.tsx": "Calculates days until Friday and the next full moon, generating corresponding messages for display in a card UI.",
  "frontend/src/components/DailyCheckInDialog.tsx": "Dialog for daily check-ins allowing users to report sobriety, drink count, and mood with validation and submission handling.",
  "frontend/src/components/DataLoggedDialog.tsx": "Simple confirmation dialog showing a status message after data is logged or updated with a continue button.",
  "frontend/src/components/DrinksChart.tsx": "Builds a 14-day bar chart of drink history, normalizing dates, tracking updates, and showing loading or syncing states.",
  "frontend/src/components/FollowUpCheckInDialog.tsx": "Dialog for follow-up check-ins asking if more drinks were consumed and optionally collecting an updated drink count.",
  "frontend/src/components/GlobalErrorBoundary.tsx": "Global React error boundary that shows a fallback UI with error details and a reload option when crashes occur.",
  "frontend/src/components/Header.tsx": "Header bar with app title and a logout button displayed at the top of the interface.",
  "frontend/src/components/MoodIndicator.tsx": "Displays the most recent mood metric with an icon and color coding, falling back to a loading spinner if needed.",
  "frontend/src/components/MotivationButton.tsx": "Button that fetches a motivation message, tracks remaining clicks, and shows it in a dialog.",
  "frontend/src/components/OnboardingFlow.tsx": "Multi-step onboarding form that collects user answers and saves a profile once all questions are answered.",
  "frontend/src/components/ProgressStats.tsx": "Displays sober-day metrics, streaks, and totals using data from progress queries.",
  "frontend/src/components/RepeatCheckInDialog.tsx": "Dialog prompting users to select a reason for a repeat check-in and submit it.",
  "frontend/src/components/SoberDaysSection.tsx": "Shows current sober-day streak and progress toward a target goal.",
  "frontend/src/components/StatusIndicatorsSection.tsx": "Calculates and displays daily and weekly drinking status indicators based on chart data.",
  "frontend/src/components/UnifiedHeaderSection.tsx": "Header showing latest feedback and a motivation button with click limits and dialog display.",
  "frontend/src/hooks/useActor.ts": "Initializes and manages the backend actor, recreating it when identity changes and invalidating dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, managing identity loading, login, logout, and status flags. Wraps AuthClient creation and exposes a hook for consuming identity state.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating backend data such as onboarding status, user profile, and check‑ins. Includes retry logic and invalidates relevant queries on successful mutations.",
  "frontend/src/index.css": "Sets up Tailwind layers and BRUTAL theme variables, including colors, typography, utilities, and neon effects. Applies global styles and custom utility classes for UI consistency.",
  "frontend/src/main.tsx": "Bootstraps the React app by rendering it inside QueryClientProvider and InternetIdentityProvider. Loads global CSS and initializes a QueryClient instance.",
  "frontend/src/pages/Dashboard.tsx": "Implements the main dashboard page, loading user data, status, and session flow to show charts, metrics, dialogs, and check‑in flows. Manages flow state and logout behavior tied to identity and React Query.",
  "frontend/src/pages/LoginPage.tsx": "Displays the login screen with branding, animated logo, and a button that triggers Internet Identity login. Handles loading state and presents feature highlights with brutalist UI cards.",
  "frontend/src/session/dailySessionFlow.ts": "Defines session phases, modal types, and a state machine to generate and advance through deterministic modal queues for onboarding and daily check‑ins.",
  "frontend/src/utils/sobrietyDuration.ts": "Parses human‑readable sobriety durations into a day count with simple keyword checks and a numeric fallback.",
  "frontend/src/utils/urlParams.ts": "Utility for reading URL and hash params, persisting them in sessionStorage, and clearing sensitive values from the URL.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, shadows, animations, and container settings for the app’s neon/brutalist theme.",
  "project_state.json": "Captures the project’s schema version, high‑level summary, and a list of implemented features with metadata and descriptions."
}