{
  "backend/main.mo": "Defines user profile types, check‑in structures, feedback messages, and integrates access control within the backend actor.",
  "feature_evidence.json": "Describes a feature report linking a login page UI update to specific files, components, and test identifiers.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of numerous frontend files describing their roles in UI, logic, and branding.",
  "frontend/index.css": "Empty stylesheet placeholder.",
  "frontend/index.html": "Base HTML document setting metadata, social previews, icons, and loading the React app entrypoint.",
  "frontend/src/App.tsx": "Main app component orchestrating authentication, actor initialization, status loading, timeouts, and routing to login, onboarding, or dashboard.",
  "frontend/src/components/BrutalFriendDialog.tsx": "Dialog component showing backend or fallback brutal messages with controlled open/close behavior.",
  "frontend/src/components/BrutalFriendFeedbackCard.tsx": "Card fetching and displaying the latest brutal friend feedback with loading and error states.",
  "frontend/src/components/ChanceOfDrinkingCard.tsx": "Card showing a placeholder randomized risk level for drinking with themed styling and icons.",
  "frontend/src/components/CycleWindowCard.tsx": "Computes days until Friday and next full moon and renders a card showing friendly and brutal messages about each.",
  "frontend/src/components/DailyCheckInDialog.tsx": "Modal for daily check‑ins letting users report sobriety, drink count, and mood with validation and form reset.",
  "frontend/src/components/DataLoggedDialog.tsx": "Confirmation dialog showing a message and variant after logging or updating data.",
  "frontend/src/components/DrinksChart.tsx": "Builds a 14‑day drinks history bar chart with update animations and loading states.",
  "frontend/src/components/FollowUpCheckInDialog.tsx": "Dialog for follow‑up check‑ins allowing users to confirm remaining sober or log additional drinks.",
  "frontend/src/components/GlobalErrorBoundary.tsx": "React error boundary that shows an error screen with reload option and error details.",
  "frontend/src/components/Header.tsx": "Header bar with app title and logout button.",
  "frontend/src/components/MoodIndicator.tsx": "Displays the most recent mood metric with emoji and color styling.",
  "frontend/src/components/MotivationButton.tsx": "Renders a button that fetches a motivation message and shows it in a dialog with click limits.",
  "frontend/src/components/OnboardingFlow.tsx": "Implements a multi-step onboarding questionnaire and submits user profile data to the backend.",
  "frontend/src/components/ProgressStats.tsx": "Displays sober day metrics with icons, handling loading and formatting numeric stats.",
  "frontend/src/components/RepeatCheckInDialog.tsx": "Dialog guiding users through repeat check-ins, including sober confirmation or entering drink counts.",
  "frontend/src/components/SoberDaysSection.tsx": "Shows current sober streak and target progress using styled cards.",
  "frontend/src/components/StatusIndicatorsSection.tsx": "Calculates and displays daily and weekly drinking status based on chart data.",
  "frontend/src/components/UnifiedHeaderSection.tsx": "Combines latest feedback display with a motivation button and dialog handling.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, invalidating queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication using AuthClient, including loading, login, logout, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user onboarding, profile, and check‑in data via the backend actor with retry logic.",
  "frontend/src/index.css": "Configures global Tailwind styles, BRUTAL theme color variables, typography, layout rules, and utility classes like neon glows and brutalist visuals.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider before rendering App.",
  "frontend/src/pages/Dashboard.tsx": "Implements the main dashboard UI, loading identity, user data, metrics, and session flow logic to guide daily and follow‑up check‑ins.",
  "frontend/src/pages/LoginPage.tsx": "Renders the login screen with branding, animations, and a button that triggers Internet Identity authentication.",
  "frontend/src/session/dailySessionFlow.ts": "Implements a deterministic session-flow state machine that resolves the current phase and generates a modal queue, with helpers to start, advance, and update state messages.",
  "frontend/src/utils/sobrietyDuration.ts": "Parses sobriety duration text into a numeric day count with simple pattern checks and a 30‑day fallback.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters (including hash routing), persisting them in sessionStorage, and clearing them for security.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, shadows, keyframes, and plugin integrations for typography, container queries, and animations.",
  "project_state.json": "Captures the project’s current schema version, high‑level summary, and a list of implemented frontend and canister features with metadata."
}