{
  "backend/main.mo": "Defines user profile types, sobriety check-in structures, brutal feedback messages, and includes access control via mixin authorization.",
  "feature_evidence.json": "Feature evidence report describing clean rebuild functionality, associated files, components, and test references.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for various frontend source files used for build planning.",
  "frontend/CLEAN_REBUILD.md": "Documentation explaining when and how to perform a clean frontend rebuild to resolve deployment issues.",
  "frontend/index.css": "Empty stylesheet placeholder for frontend global styles.",
  "frontend/index.html": "HTML entry point defining metadata, social tags, and root element for the frontend app.",
  "frontend/scripts/clean-rebuild.sh": "Shell script that removes build artifacts and caches to perform a clean frontend rebuild.",
  "frontend/src/App.tsx": "Main React component handling authentication flow, actor initialization, status loading, and routing to login, onboarding, or dashboard.",
  "frontend/src/components/BeerDonationDialog.tsx": "Dialog component displaying a donation address with copy-to-clipboard support and closure handling.",
  "frontend/src/components/BrutalFriendDialog.tsx": "Controlled dialog showing backend or fallback brutal messages with a close button.",
  "frontend/src/components/BrutalFriendFeedbackCard.tsx": "Fetches and displays the latest brutal friend feedback with loading, error, and fallback handling.",
  "frontend/src/components/ChanceOfDrinkingCard.tsx": "Shows a random drinking risk level with color‑coded UI and descriptive messaging.",
  "frontend/src/components/CycleWindowCard.tsx": "Calculates days until Friday and the next full moon to generate friendly and brutal cycle messages.",
  "frontend/src/components/DailyCheckInDialog.tsx": "Modal for daily check-ins letting users report sobriety, drink count, and mood with validation.",
  "frontend/src/components/DataLoggedDialog.tsx": "Confirmation dialog showing a message and variant‑based subtext after data is logged or updated.",
  "frontend/src/components/DrinksChart.tsx": "Renders a 14‑day drinks history bar chart with update detection, loading states, and day normalization.",
  "frontend/src/components/FollowUpCheckInDialog.tsx": "Modal for follow‑up check-ins to confirm sobriety or log additional drinks with validation.",
  "frontend/src/components/GlobalErrorBoundary.tsx": "Global error boundary that catches render errors and displays a recovery UI with reload option.",
  "frontend/src/components/Header.tsx": "Renders the app header with title and a logout button callback.",
  "frontend/src/components/MoodIndicator.tsx": "Displays the user's most recent mood using progress metrics and shows a loading spinner while fetching.",
  "frontend/src/components/MotivationButton.tsx": "Provides a button to fetch motivation messages with limited daily clicks and opens a dialog showing the result.",
  "frontend/src/components/OnboardingFlow.tsx": "Implements a multi‑step onboarding questionnaire, tracks answers, and submits the final profile to the backend.",
  "frontend/src/components/ProgressStats.tsx": "Shows sober-day statistics from progress metrics with icons and styled stat cards.",
  "frontend/src/components/RepeatCheckInDialog.tsx": "Dialog for repeat daily check-ins allowing users to confirm sobriety or enter drink count with validation.",
  "frontend/src/components/SoberDaysSection.tsx": "Displays current sober streak and a target goal with styled cards.",
  "frontend/src/components/StatusIndicatorsSection.tsx": "Calculates and displays today, yesterday, and weekly drink-status indicators based on aggregated chart data.",
  "frontend/src/components/UnifiedHeaderSection.tsx": "Header component showing brutal friend feedback and a motivational message button with dialog handling.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the authenticated identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handles login, stored identity loading, and identity state management.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching and mutating backend data including profiles, check-ins, and onboarding/check-in status.",
  "frontend/src/index.css": "Global styles including brutalist theme variables, Tailwind layers, neon effects, and layout resets.",
  "frontend/src/main.tsx": "App entry point setting up QueryClient and InternetIdentityProvider before rendering the app.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page orchestrating user session flow, data loading, check-in handling, and UI sections.",
  "frontend/src/pages/LoginPage.tsx": "React login screen using Internet Identity with animated logo, a continue button, and brief feature cards.",
  "frontend/src/session/dailySessionFlow.ts": "Defines a deterministic session-flow state machine for onboarding and daily check‑in modal sequences.",
  "frontend/src/utils/sobrietyDuration.ts": "Parses human-readable sobriety duration text into a numeric day count with fallbacks.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and cleaning URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, shadows, animations, and container settings for the app’s neon/brutalist theme.",
  "project_state.json": "Metadata describing the project’s current features, visual style, session logic, and deployment context."
}