{
  "backend/main.mo": "Motoko actor defining user profile types, check-in structures, authorization mixins, and brutal friend feedback messages.",
  "feature_evidence.json": "Feature evidence report describing the addition of the Usergeek tracking snippet and its associated metadata.",
  "frontend-file-summaries.txt": "Text file listing prewritten summaries of multiple frontend source files.",
  "frontend/CLEAN_REBUILD.md": "Guide explaining how to perform a clean rebuild of the frontend to resolve build or deployment issues.",
  "frontend/index.css": "Empty CSS file placeholder for global styles.",
  "frontend/index.html": "Main HTML entry point including metadata, favicon links, and the Usergeek analytics snippet.",
  "frontend/scripts/clean-rebuild.sh": "Shell script that deletes build artifacts, caches, and lockfiles to force a clean frontend rebuild.",
  "frontend/src/App.tsx": "Main React app component handling authentication, actor initialization, status checks, and fallback UI flows.",
  "frontend/src/components/BeerDonationDialog.tsx": "Modal dialog allowing users to copy a donation address with visual feedback and clipboard handling.",
  "frontend/src/components/BrutalFriendDialog.tsx": "Dialog that displays a random ‘brutal’ motivational message when opened.",
  "frontend/src/components/BrutalFriendFeedbackCard.tsx": "Card that fetches and displays the latest brutal friend feedback with loading and error states.",
  "frontend/src/components/ChanceOfDrinkingCard.tsx": "Card showing a random drinking‑risk level with color‑coded visual indicators.",
  "frontend/src/components/CycleWindowCard.tsx": "Card computing days until Friday and the next full moon, generating corresponding normal and brutal messages.",
  "frontend/src/components/DailyCheckInDialog.tsx": "Dialog for daily check‑ins where users report sobriety, drink count, and mood, then submit the data.",
  "frontend/src/components/DataLoggedDialog.tsx": "Dialog confirming data submission with a message and optional variant styling.",
  "frontend/src/components/DrinksChart.tsx": "14‑day bar chart visualizing drink counts, with update animations and loading indicators.",
  "frontend/src/components/FollowUpCheckInDialog.tsx": "Dialog for quick follow‑up check‑ins where users confirm sobriety or enter additional drinks.",
  "frontend/src/components/GlobalErrorBoundary.tsx": "Global React error boundary displaying a styled fallback UI with reload and error details.",
  "frontend/src/components/Header.tsx": "Top navigation header showing the app title and a logout button.",
  "frontend/src/components/MoodIndicator.tsx": "Displays the user's latest mood metric with an icon and color‑coded label.",
  "frontend/src/components/MotivationButton.tsx": "Button that fetches a motivation message and shows it in a dialog with click limits.",
  "frontend/src/components/OnboardingFlow.tsx": "Multi‑step onboarding questionnaire that collects user profile answers and submits them to the backend.",
  "frontend/src/components/ProgressStats.tsx": "Shows key sobriety metrics such as sober days, streak, tracked days, and drunk days.",
  "frontend/src/components/RepeatCheckInDialog.tsx": "Dialog for repeated daily check‑ins where users confirm sobriety or log drink counts.",
  "frontend/src/components/SoberDaysSection.tsx": "Displays current sober streak and progress toward a target number of sober days.",
  "frontend/src/components/StatusIndicatorsSection.tsx": "Displays weekly, yesterday, and today drinking-status indicators by computing normalized dates and average drinks from chart data.",
  "frontend/src/components/UnifiedHeaderSection.tsx": "Shows brutal-friend feedback and a motivation button with request handling, click limits, and dialog display.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and refreshes dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, loading stored identity, handling login, clearing identity, and exposing status flags.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for onboarding and check-in status, user profile operations, and various backend interactions with retries.",
  "frontend/src/index.css": "Sets Tailwind-based brutalist theme variables, fonts, glow utilities, and layout rules for the app.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider, then renders App.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page managing daily check‑in flow, user data queries, and modal session state logic.",
  "frontend/src/pages/LoginPage.tsx": "Login screen with Internet Identity authentication and animated branding elements.",
  "frontend/src/session/dailySessionFlow.ts": "Deterministic state machine defining session phases, modal queues, and flow transitions for daily check‑ins.",
  "frontend/src/utils/sobrietyDuration.ts": "Parses onboarding sobriety duration text into a numeric day count with fallbacks.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters, supporting hash and query routing.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, animations, and layout settings.",
  "project_state.json": "Project metadata describing integration plans, features, and architectural notes."
}