{
  "backend/main.mo": "Actor defining user profile types, check-in data structures, authorization mixin usage, and brutal feedback message list.",
  "feature_evidence.json": "Feature evidence report indicating a UI text update on the dashboard button and related metadata.",
  "frontend-file-summaries.txt": "Plain text mapping of frontend file paths to brief functional descriptions for build planning.",
  "frontend/index.css": "Empty stylesheet placeholder for global frontend styles.",
  "frontend/index.html": "Main HTML document defining metadata, social tags, icons, and mounting point for the frontend app.",
  "frontend/src/App.tsx": "Root React component handling authentication, actor initialization, status loading fallbacks, and routing to login, onboarding, or dashboard.",
  "frontend/src/components/BrutalFriendDialog.tsx": "Controlled dialog showing backend or fallback brutal feedback messages with UI actions.",
  "frontend/src/components/BrutalFriendFeedbackCard.tsx": "Card component fetching and displaying the latest brutal feedback with loading and error states.",
  "frontend/src/components/ChanceOfDrinkingCard.tsx": "Card showing a placeholder random drinking-risk level with colored styling.",
  "frontend/src/components/CycleWindowCard.tsx": "Calculates days until Friday and the next full moon, producing themed messages and rendering them inside a card component.",
  "frontend/src/components/DailyCheckInDialog.tsx": "Dialog for daily check‑ins capturing sobriety, drink count, and mood with validation and form reset behavior.",
  "frontend/src/components/DataLoggedDialog.tsx": "Simple confirmation dialog showing a message and icon after data is logged or updated.",
  "frontend/src/components/DrinksChart.tsx": "Renders a 14‑day drinks history bar chart, normalizing dates and animating updates when data changes.",
  "frontend/src/components/FollowUpCheckInDialog.tsx": "Follow‑up dialog asking if more drinks were consumed and optionally collecting an additional drink count.",
  "frontend/src/components/GlobalErrorBoundary.tsx": "Error boundary that catches component tree errors and shows a fallback UI with reload option and details.",
  "frontend/src/components/Header.tsx": "Top navigation header with branding and a logout button.",
  "frontend/src/components/MoodIndicator.tsx": "Displays the most recent mood from progress metrics with an icon and color coding.",
  "frontend/src/components/MotivationButton.tsx": "Button that fetches a motivation message, tracks remaining clicks, and opens a dialog to display it.",
  "frontend/src/components/OnboardingFlow.tsx": "Multi-step onboarding form that collects user answers and submits a profile once all questions are completed.",
  "frontend/src/components/ProgressStats.tsx": "Displays sober days, streak, tracked days, and drunk days from progress metrics with loading skeletons.",
  "frontend/src/components/RepeatCheckInDialog.tsx": "Dialog prompting whether the user is still sober and, if not, asks for number of drinks before submitting.",
  "frontend/src/components/SoberDaysSection.tsx": "Shows current sober-day streak and a target comparison using styled cards.",
  "frontend/src/components/StatusIndicatorsSection.tsx": "Computes and displays today, yesterday, and weekly drinking status based on chart data.",
  "frontend/src/components/UnifiedHeaderSection.tsx": "Combined header showing brutal friend feedback and a motivation button with click limits and dialog.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages an authenticated or anonymous backend actor and refreshes dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, managing identity loading, login, logout, and auth-client configuration.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating onboarding, profile, and check-in data using the backend actor with retry logic.",
  "frontend/src/index.css": "Tailwind-based global styles defining a brutalist neon theme, base typography, layout fixes, and utility classes.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and InternetIdentityProvider before rendering App.",
  "frontend/src/pages/Dashboard.tsx": "Dashboard page that orchestrates user identity, profile data, check-in flows, dialogs, and metrics displays using multiple hooks.",
  "frontend/src/pages/LoginPage.tsx": "Login page showing branding and a button that triggers Internet Identity login with loading states and animations.",
  "frontend/src/session/dailySessionFlow.ts": "Implements a deterministic session-flow state machine controlling onboarding and daily check-in modal queues. Provides phase resolution, modal queue generation, state initialization, navigation, and message setters.",
  "frontend/src/utils/sobrietyDuration.ts": "Parses human-readable sobriety duration text into a numeric day count with simple pattern matching and a 30‑day fallback.",
  "frontend/src/utils/urlParams.ts": "Utility helpers to read URL parameters (including hash routing), persist them in sessionStorage, and clear sensitive params from the URL.",
  "frontend/tailwind.config.js": "Tailwind CSS config extending colors, shadows, keyframes, and layout settings with custom theme variables for the app’s neon/brutalist design.",
  "project_state.json": "Tracks project metadata, features, and system capabilities for the sobriety‑tracking app’s React + Motoko architecture."
}