{
  "backend/main.mo": "Main canister actor defining user profile types, check-in data models, and brutal friend feedback messages with authorization mixin.",
  "backend/migration.mo": "Migration module upgrading stored user profiles by adding streakTarget and achievementShownForThisTarget fields.",
  "feature_evidence.json": "Feature evidence report mapping streak-achievement and UI requirements to affected frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing functionality of all major frontend components and utilities.",
  "frontend/CLEAN_REBUILD.md": "Guide explaining how to perform a full clean rebuild of the frontend to resolve deployment issues.",
  "frontend/index.css": "Empty stylesheet placeholder for root-level frontend CSS.",
  "frontend/index.html": "HTML entrypoint defining metadata, root mount element, and Usergeek analytics loader.",
  "frontend/scripts/clean-rebuild.sh": "Shell script that removes cached build artifacts, dependencies, and tool caches for a clean frontend rebuild.",
  "frontend/src/App.tsx": "Root React component handling authentication, onboarding gating, user profile loading, and analytics identification/sync logic.",
  "frontend/src/components/BeerDonationDialog.tsx": "A dialog showing a BTC donation address with copy-to-clipboard functionality and beer-themed messaging.",
  "frontend/src/components/BrutalFriendDialog.tsx": "A dialog that displays a selected or random brutal motivational message using a large predefined list.",
  "frontend/src/components/BrutalFriendFeedbackCard.tsx": "A card that loads and displays the latest brutal friend feedback while tracking analytics and handling loading/error states.",
  "frontend/src/components/ChanceOfDrinkingCard.tsx": "A card that shows a randomly generated drinking‑risk status with corresponding colors and styling.",
  "frontend/src/components/CycleWindowCard.tsx": "Computes days until Friday and the next full moon to generate cycle-based friendly and brutal messages displayed in a card.",
  "frontend/src/components/DailyCheckInDialog.tsx": "A dialog for daily sobriety check‑ins letting users report sober status, drink count, and mood, with validation and submission.",
  "frontend/src/components/DataLoggedDialog.tsx": "A generic confirmation dialog showing a message and variant-specific note after data is logged or updated.",
  "frontend/src/components/DrinksChart.tsx": "Renders a 14‑day bar chart of drink counts with update animations and loading states. Normalizes dates and builds chart data from aggregated entries.",
  "frontend/src/components/FollowUpCheckInDialog.tsx": "Provides a dialog for quick follow-up check-ins, allowing users to confirm sobriety or enter additional drinks. Handles validation and submission callbacks.",
  "frontend/src/components/FullScreenLoading.tsx": "Displays a centered full-screen loading spinner with a simple message.",
  "frontend/src/components/FullScreenStatusError.tsx": "Shows a full-screen error state when status fetch fails, offering retry and page refresh actions.",
  "frontend/src/components/GlobalErrorBoundary.tsx": "Catches unhandled React errors and shows a full-screen fallback UI with reload option and error details.",
  "frontend/src/components/Header.tsx": "Renders the top navigation header with branding and a logout button.",
  "frontend/src/components/MoodIndicator.tsx": "Fetches recent mood data and displays an emoji and label based on the latest entry, with a loading state.",
  "frontend/src/components/MotivationButton.tsx": "Provides a button to fetch motivational messages with daily limits, opens a dialog, and tracks user clicks.",
  "frontend/src/components/OnboardingFlow.tsx": "Guides users through a multi-step onboarding form, validates responses, and submits profile data with analytics tracking.",
  "frontend/src/components/ProgressStats.tsx": "Displays key progress metrics like sober days, streaks, and tracked days using styled statistic cards with icons.",
  "frontend/src/components/RepeatCheckInDialog.tsx": "Modal for repeat daily check-ins allowing users to confirm sobriety or enter drink count with validation and state resets.",
  "frontend/src/components/SoberDaysSection.tsx": "Displays sober streak and target progress using metrics and styled cards.",
  "frontend/src/components/StatusIndicatorsSection.tsx": "Computes and shows today, yesterday, and weekly drinking status based on chart data.",
  "frontend/src/components/StreakAchievementOverlay.tsx": "Full-screen overlay celebrating streak milestones and prompting user to pick a new target.",
  "frontend/src/components/UnifiedHeaderSection.tsx": "Header section showing brutal friend feedback and a motivation message button with rate limits.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages a backend actor tied to Internet Identity, invalidating dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, including loading, logging in, clearing identity, and tracking login status.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating backend data such as user profiles, onboarding status, and check-ins with retry logic.",
  "frontend/src/index.css": "Sets up Tailwind CSS layers and defines a brutalist theme with neon colors, utilities, and global base styles.",
  "frontend/src/main.tsx": "Bootstraps the React app by mounting it with React Query and Internet Identity providers.",
  "frontend/src/pages/Dashboard.tsx": "Implements the main dashboard page, handling check-ins, user progress, achievements, dialogs, and related data fetching and mutations.",
  "frontend/src/pages/LoginPage.tsx": "Renders the login page UI and triggers Internet Identity login with branding, animations, and loading states.",
  "frontend/src/session/dailySessionFlow.ts": "Implements a session-phase state machine and modal queue system for onboarding and daily check-in flows.",
  "frontend/src/utils/dailyCheckInAutoOpenGuards.ts": "Provides per-day sessionStorage guards to ensure the daily check-in dialog auto-opens only once per local day.",
  "frontend/src/utils/sobrietyDuration.ts": "Parses various sobriety duration strings into numeric day counts with a default fallback of 30 days.",
  "frontend/src/utils/streakTargets.ts": "Defines streak target options and converts selected targets into numeric day values.",
  "frontend/src/utils/urlParams.ts": "Handles URL parameter extraction, persistence in sessionStorage, and safe cleanup from hash-based routing.",
  "frontend/src/utils/usergeek.ts": "Wraps UserGeek analytics with safety checks, deduplication, and helpers for events, page views, and dedupe keys.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, animations, and plugins for the project's design system.",
  "project_state.json": "Describes the BRUTAL app state and planned streak-achievement feature requirements and constraints."
}