{
  "backend/main.mo": "Main Motoko canister defining user profiles, onboarding, daily check-ins, aggregated history, and authorization mixins, plus storing and serving \"brutal friend\" feedback messages. Includes data types, access control setup, and migration hook wiring.",
  "backend/migration.mo": "Defines a no-op migration that preserves existing PersistentUserProfile state across upgrades, re-declaring shared data types for compatibility.",
  "feature_evidence.json": "Feature evidence report documenting a frontend update to expand the fallback brutal message list for UI consistency, with referenced files, components, and test IDs.",
  "frontend-file-summaries.txt": "Pre-generated high-level summaries of frontend source files describing app structure, hooks, pages, components, styling, and recent UI/logic changes.",
  "frontend/index.css": "Global CSS entry point (currently empty or deferred) intended for base styles or overrides applied across the frontend.",
  "frontend/index.html": "HTML entry document configuring metadata, social previews, icons, theme color, and mounting the React app at the root element.",
  "frontend/src/App.tsx": "Root React component handling authentication, actor initialization, onboarding/status checks, fallback timeouts, error handling, and routing between login, onboarding, and dashboard views.",
  "frontend/src/components/BrutalFriendDialog.tsx": "Dialog component that displays a sarcastic \"brutal friend\" message from the backend or a large local fallback pool, styled with dark brutalist UI and neon accents.",
  "frontend/src/components/BrutalFriendFeedbackCard.tsx": "Dashboard card that fetches and displays the latest brutal friend feedback with loading, error, and safe fallback handling.",
  "frontend/src/components/ChanceOfDrinkingCard.tsx": "UI card showing a placeholder, randomly generated risk level for drinking tomorrow, with color-coded status and brutalist styling.",
  "frontend/src/components/CycleWindowCard.tsx": "Displays a card showing days until Friday and the next full moon using date calculations and preset 2026 moon dates, with both normal and \"brutal\" message variants.",
  "frontend/src/components/DailyCheckInDialog.tsx": "Implements the daily check-in modal that prompts users about sobriety, drinks, and mood, submits data via backend hooks, and shows feedback and a Brutal Friend response.",
  "frontend/src/components/DrinksChart.tsx": "Renders a 14-day bar chart of daily drink counts using Recharts, with loading, syncing, and visual update indicators.",
  "frontend/src/components/FollowUpCheckInDialog.tsx": "Handles a follow-up check-in dialog for users who drank more after their initial check-in, submitting updates and showing feedback and Brutal Friend messaging.",
  "frontend/src/components/GlobalErrorBoundary.tsx": "Provides a React error boundary that catches uncaught errors, logs details, and displays a full-page fallback UI with a reload option.",
  "frontend/src/components/Header.tsx": "Defines the sticky app header with branding and a logout button that triggers a provided logout handler.",
  "frontend/src/components/MoodIndicator.tsx": "Shows the user's most recent mood from progress metrics with an emoji, label, and color-coded styling.",
  "frontend/src/components/MotivationButton.tsx": "Displays a button that fetches a limited-use motivational message from the backend and presents it in a Brutal Friend dialog.",
  "frontend/src/components/OnboardingFlow.tsx": "Implements a multi-step onboarding questionnaire that collects user profile answers, auto-advances on selection, detects the user's time zone, and saves the profile to the backend with error handling and progress UI.",
  "frontend/src/components/ProgressStats.tsx": "Fetches and displays high-level sobriety metrics (sober days, current streak, days tracked, drunk days) in a responsive stat card grid with loading placeholders.",
  "frontend/src/components/SoberDaysSection.tsx": "Renders two highlight cards showing the user's current sober streak and progress toward a configurable sober-days target using provided metrics.",
  "frontend/src/components/StatusIndicatorsSection.tsx": "Derives and displays status indicators for weekly average, yesterday, and today (e.g., Sober, Few Drinks, Drunk) based on aggregated drink-entry data.",
  "frontend/src/components/UnifiedHeaderSection.tsx": "Shows the latest \"brutal friend\" feedback, handles loading and error states, and provides a limited-use motivation button that fetches and displays motivational messages in a dialog.",
  "frontend/src/hooks/useActor.ts": "Provides a React Query hook that creates and caches a backend actor based on the current Internet Identity, initializes access control, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Defines the Internet Identity context and provider, managing authentication state, login/logout flows, persisted identities, and exposing status helpers via a custom hook.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating backend data such as onboarding/check-in status, user profiles, check-ins, and progress metrics, using an actor abstraction with retry and cache invalidation logic.",
  "frontend/src/index.css": "Global Tailwind CSS stylesheet defining a brutalist dark theme with OKLCH color variables, base styles, and utility classes for neon effects, cards, animations, and layout behavior.",
  "frontend/src/main.tsx": "Application entry point that creates the React root and wraps the app with React Query and Internet Identity providers before rendering the main App component.",
  "frontend/src/pages/Dashboard.tsx": "Implements the main authenticated dashboard page, composing multiple data-driven sections (charts, metrics, check-ins, status cards) and handling identity state and logout.",
  "frontend/src/pages/LoginPage.tsx": "Renders the login screen with branding, messaging, and a button to initiate Internet Identity authentication, including loading states and visual effects.",
  "frontend/src/utils/sobrietyDuration.ts": "Utility function that parses a human-readable sobriety duration string into a numeric day count, with sensible defaults and fallbacks.",
  "frontend/src/utils/urlParams.ts": "Helper utilities for reading, persisting, and clearing URL and session-based parameters, supporting both query-string and hash-based routing.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration enabling class-based dark mode, scanning frontend source files, and extending the theme with OKLCH-based design tokens, custom container sizing, border radii, shadows, animations, and plugins (typography, container queries, animate).",
  "project_state.json": "High-level machine-readable snapshot of the BRUTAL project, describing the app’s purpose, architecture (React + Motoko on ICP), and a versioned catalog of existing features such as authentication, actor management, access control, onboarding, and check-in workflows."
}