{
  "kind": "build_request",
  "title": "Add 30+ new brutal motivational quotes referencing age, other drugs, family, health, and sports performance",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add at least 30 NEW motivational/brutal-friend quotes (in English) that are cheeky, fun, brutally friendly, and honest, and that explicitly reference: age (age range), other drugs/habits including games and porn, family, health, and sports performance. These quotes must be appended to the existing quote pool used by the backend motivation/feedback message generator.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "great, now we need to add more motivational quotes, make them brutal and reference age, other drugs including games and porn, family, health and sports performance in a cheeky fun and brutal friendly and honest way, add at least 30 of them"
        ]
      },
      "acceptanceCriteria": [
        "backend/main.mo contains at least 30 additional unique quotes beyond the current list in brutalFriendFeedbackMessages.",
        "The new quotes include coverage across the requested themes (age, games/porn/other drugs, family, health, sports performance), with the same overall ‘brutal friend’ tone as existing messages.",
        "Calling getMotivationMessage can return any of the expanded quote pool (not just the original set)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update the frontend fallback brutal message list used by the motivation dialog so it includes the same expanded quote pool (including the 30+ new quotes) to keep the UI consistent when a backend message is missing/empty.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "add at least 30 of them"
        ]
      },
      "acceptanceCriteria": [
        "frontend/src/components/BrutalFriendDialog.tsx brutalMessages includes the new 30+ quotes (or otherwise sources the same expanded set) so that random fallback messages can be any of the added quotes.",
        "No user-facing text for these messages appears in any language other than English."
      ]
    }
  ],
  "constraints": [
    "Respect single-actor backend architecture: all Motoko logic stays in backend/main.mo.",
    "Do not edit any frontend files under frontend/src/components/ui or any path listed in frontend.immutablePaths."
  ],
  "nonGoals": [
    "Do not change motivation rate limiting logic (daily click limit) or add new limits.",
    "Do not change onboarding questions/fields or add new profile fields.",
    "Do not implement a new personalization/templating system for injecting specific age/family/health values into messages (only expand the quote library as requested).",
    "Do not create or require a backend migration for this change."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}