{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "BRUTAL - Sobriety Tracking now includes a darker neon/brutalist visual identity, expanded popup/session logic (onboarding only once, first daily check-in, repeat same-day follow-up check-in, and Brutal Friend feedback), a JSON-driven feedback matrix for deterministic message selection (plus motivation messages), user-local time zone handling for day-boundaries, cycle-window context (days until Friday/weekend + full-moon countdown), a dashboard layout reorganization (feedback + motivation on top; chance-of-drinking + cycle window side-by-side; graph removed), and a beer-donation button placed next to CHECK IN. The user is preparing to publish live and map a custom domain (brutal.services), and requested a clean rebuild due to deployment failure.",
  "existing_features": [
    {
      "id": "IF-1",
      "title": "Internet Identity authentication (login/logout + session restore)",
      "synonyms": [
        "II login",
        "AuthClient integration",
        "Delegation persistence"
      ],
      "description": "Provides Internet Identity authentication via a React provider/hook, restores an existing delegation on load, supports login with configurable identity provider, and supports logout/clear of stored identity.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-2",
      "title": "Backend canister actor creation (anonymous and authenticated)",
      "synonyms": [
        "useActor",
        "actor lifecycle"
      ],
      "description": "Creates an anonymous actor when no identity is present and an authenticated actor when logged in; actor instances are cached by principal and trigger global React Query invalidation/refetch when they change.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-3",
      "title": "Authorization bootstrap using a secret admin token",
      "synonyms": [
        "_initializeAccessControlWithSecret",
        "admin bootstrap"
      ],
      "description": "On authenticated actor initialization, calls a canister method that assigns the caller an initial role (admin if the provided secret matches CAFFEINE_ADMIN_TOKEN and no admin exists; otherwise user).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-4",
      "title": "Role-based access control (admin/user/guest)",
      "synonyms": [
        "RBAC",
        "AccessControl module"
      ],
      "description": "Implements per-principal roles and permission checks in Motoko; exposes APIs to query caller role, query admin status, and allow admins to assign roles to other principals.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-5",
      "title": "Secret parameter extraction from URL hash with session persistence and URL cleanup",
      "synonyms": [
        "getSecretParameter",
        "hash secret parsing",
        "sessionStorage secret"
      ],
      "description": "Reads sensitive parameters (e.g., caffeineAdminToken) from the URL hash fragment, stores them in sessionStorage for the session, and removes them from the URL to reduce history/referrer leakage.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-6",
      "title": "Persistent user profile model (onboarding + tracking state)",
      "synonyms": [
        "PersistentUserProfileView",
        "onboardingAnswers"
      ],
      "description": "Defines and stores a per-user profile including onboarding answers (age range, drinks/week, motivation, secondary substance, sobriety duration, time zone), onboarding completion flag, aggregated daily entries, repeat check-in log, current-day counters, latest brutal feedback, and motivation click counters.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-7",
      "title": "Onboarding questionnaire wizard with time zone detection and save UX",
      "synonyms": [
        "OnboardingFlow",
        "setup wizard"
      ],
      "description": "Multi-step onboarding UI with progress bar and auto-advance on selection; detects browser time zone, builds a full PersistentUserProfileView payload, saves via mutation with error/success screens, and invalidates status queries to advance the app flow.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-8",
      "title": "Onboarding & daily check-in status API for flow gating",
      "synonyms": [
        "checkOnboardingAndCheckInStatus",
        "dailyCheckInsToday"
      ],
      "description": "Backend endpoint returns onboarding requirement and daily status (needsDailyCheckIn, completion flags, first-login-of-day marker, follow-up flag, and today’s check-in count); frontend queries it to decide whether to show onboarding and which check-in flow applies.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-9",
      "title": "Daily check-in dialog UI (sober/drinks/mood)",
      "synonyms": [
        "DailyCheckInDialog",
        "daily modal"
      ],
      "description": "Controlled dialog that collects sober vs drank, conditional drink count input, and mood selection (happy/neutral/sad) with validation and toast errors; resets internal state on close or successful submit.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-10",
      "title": "Daily check-in submission with per-day aggregation",
      "synonyms": [
        "submitCheckIn",
        "AggregatedEntry merge"
      ],
      "description": "Backend accepts a check-in entry and merges it into a per-day aggregated entry (drinks summed, sober ANDed, mood updated, checkInCount incremented). Returns a brutal feedback message and updated totals; frontend mutation invalidates dependent queries.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-11",
      "title": "Repeat check-in reason capture (backend + frontend hook)",
      "synonyms": [
        "submitRepeatCheckIn",
        "RepeatCheckInReason"
      ],
      "description": "Backend records repeat check-in events with timestamp and a structured reason enum; frontend provides a mutation that submits the reason and fetches updated brutal feedback, invalidating relevant caches.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-12",
      "title": "Follow-up check-in endpoint for same-day drink updates",
      "synonyms": [
        "submitFollowUpCheckIn",
        "same-day add drinks"
      ],
      "description": "Backend endpoint appends additional drinks to today by merging a non-sober aggregated entry and generating updated brutal feedback; frontend exposes a mutation hook and uses it from repeat/follow-up dialogs.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-13",
      "title": "Repeat check-in dialog (still sober vs drank)",
      "synonyms": [
        "RepeatCheckInDialog",
        "secondary check-in"
      ],
      "description": "Two-step controlled dialog: asks if the user is still sober; if not, collects additional drinks and submits a follow-up update; includes validation and state reset on close/submit.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-14",
      "title": "Progress metrics computation and dashboard stat cards",
      "synonyms": [
        "getProgressMetrics",
        "ProgressStats",
        "SoberDaysSection"
      ],
      "description": "Backend computes sober days, drank days, current streak, total check-ins, and returns recent entries; frontend renders metric cards and a streak/target section with the target derived from onboarding sobrietyDuration parsing.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-15",
      "title": "14-day history retrieval and drinks chart visualization",
      "synonyms": [
        "getLast14Days",
        "DrinksChart"
      ],
      "description": "Backend returns aggregated entries for the last 14 days (sorted by date); frontend renders a 14-day bar chart with day normalization and UI indicators for updating/synced state.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-16",
      "title": "Status indicators (weekly average, yesterday, today)",
      "synonyms": [
        "StatusIndicatorsSection",
        "weekly average status"
      ],
      "description": "Computes and displays weekly average drinking status plus yesterday/today status by matching normalized day buckets against aggregated entries and applying simple thresholds.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-17",
      "title": "Mood tracking and mood trend",
      "synonyms": [
        "Mood enum",
        "getMoodTrend",
        "MoodIndicator"
      ],
      "description": "Check-ins may include an optional mood; backend exposes an averaged mood trend metric, and frontend displays the most recent mood indicator based on recent aggregated entries.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-18",
      "title": "Brutal Friend feedback generation, retrieval, and display",
      "synonyms": [
        "getLatestBrutalFriendFeedback",
        "BrutalFriendDialog",
        "UnifiedHeaderSection"
      ],
      "description": "Backend generates/stores a brutal feedback message and serves the latest message; frontend displays it in a unified header/card and also reuses a dialog component that shows backend text or a random fallback quote list.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-19",
      "title": "Motivation message endpoint with daily limit and UI",
      "synonyms": [
        "getMotivationMessage",
        "MotivationButton",
        "Need Motivation"
      ],
      "description": "Backend returns a motivation message with per-day click limiting (3/day) and remaining-click counters; frontend provides buttons that fetch and display the message in a dialog and disables when the limit is reached.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-20",
      "title": "Centralized daily session flow controller (state machine + FIFO modal queue)",
      "synonyms": [
        "dailySessionFlow",
        "SessionPhase",
        "ModalType queue"
      ],
      "description": "Implements deterministic phase resolution and a FIFO modal queue to enforce ordered daily popups (daily/repeat check-in → data logged → brutal friend), with helpers to start/advance/end the flow and store per-flow messages.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-21",
      "title": "App routing/gating with connection/loading timeouts and error recovery",
      "synonyms": [
        "App.tsx gating",
        "GlobalErrorBoundary",
        "toast errors"
      ],
      "description": "Routes between Login, Onboarding, and Dashboard based on authentication and status; adds timeouts to avoid indefinite loading states, surfaces status errors via toasts, and wraps UI in a global error boundary with reload recovery.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-22",
      "title": "Dashboard check-in controls with beer donation UX",
      "synonyms": [
        "BUY ME A BEER",
        "BeerDonationDialog",
        "clipboard copy"
      ],
      "description": "Dashboard renders a second button next to CHECK IN to support beer donations. Clicking attempts to copy the ICP donation address to clipboard and shows a toast; if clipboard access fails, a dialog provides the address with manual copy controls and instructions.",
      "reqIds": [
        "REQ-6",
        "REQ-7"
      ],
      "version": 1
    },
    {
      "id": "IF-23",
      "title": "Cycle and risk helper cards on dashboard (placeholder analytics)",
      "synonyms": [
        "ChanceOfDrinkingCard",
        "CycleWindowCard"
      ],
      "description": "Dashboard includes helper cards showing a (currently randomized) chance-of-drinking status and a cycle window card computing days until Friday/weekend and next full moon with themed messages.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-24",
      "title": "Neon/brutalist design system and UI primitives",
      "synonyms": [
        "Tailwind OKLCH theme",
        "shadcn UI",
        "brutal-card"
      ],
      "description": "Defines a brutalist dark theme with OKLCH CSS variables, neon glow utilities, brutal shadows, custom animations, and reusable UI primitives (Dialog/Card/Button/Input) for consistent styling.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "feature-perform-a-clean-rebuild-of-the-project-and-redeploy-the-canisters-ensuring-all-prior-build-artifacts-caches-are-cleared-so-the-deployment-runs-from-a-fresh-build-state",
      "title": "Perform a clean rebuild of the project and redeploy the canisters, ensuring all prior build artifacts/caches are cleared so the deployment runs from a fresh build state.",
      "reqIds": [
        "REQ-8"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Add \"missed day\" (skipped-date) popup to encourage daily return after user misses a check-in day",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-2",
      "summary": "Add sober-streak milestone feedback (2, 4, weekend, week, 2 weeks) to celebrate progress and encourage continuation",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-3",
      "summary": "Custom domain setup for production launch (map purchased domain brutal.services to IC deployment)",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-4",
      "summary": "XP/experience tracker in top bar (+5 XP per sober day, -2 XP per drunk day)",
      "reqIds": [],
      "status": "pending"
    }
  ],
  "architectural_notes": [
    "React + TypeScript SPA using TanStack React Query for query/mutation orchestration, retries, caching, and invalidation-based refresh.",
    "Internet Identity auth handled via a dedicated React context/provider wrapping @dfinity/auth-client with delegation persistence across reloads.",
    "Backend access encapsulated in a useActor hook that creates anonymous/authenticated canister actors keyed by principal and triggers broad query invalidation on actor change.",
    "Motoko backend composes authorization via a mixin (MixinAuthorization) over a shared access-control module implementing role assignment and admin checks.",
    "Sensitive admin token is read from the URL hash and persisted in sessionStorage, then removed from the URL to reduce leakage.",
    "Daily UX is coordinated by a pure deterministic state machine (session phase resolution + FIFO modal queue) consumed by the Dashboard to control dialog sequencing.",
    "Backend aggregates check-ins into day buckets using a fixed day-normalization offset (-6 hours) mirrored by some frontend computations.",
    "UI design system is Tailwind + shadcn/Radix primitives, using OKLCH theme variables and brutalist/neon utility styles.",
    "Cross-boundary numeric data uses bigint/Nat64/Nat; UI converts to number only for presentation and local arithmetic.",
    "Feedback/motivation messaging is generated from predefined message banks and returned to the UI via dedicated endpoints."
  ],
  "known_issues": [
    "When logged out, an anonymous actor is still created and the status query can run; the canister then traps with Unauthorized, potentially causing noisy errors/toasts before login.",
    "If the CAFFEINE_ADMIN_TOKEN environment variable is not set on the canister, _initializeAccessControlWithSecret traps and blocks actor initialization for authenticated users.",
    "Canister state (roles and user profiles) is stored in in-memory Maps/Lists and is not persisted as stable state across upgrades/reinstalls.",
    "saveCallerUserProfile overwrites the entire stored profile document; callers must provide a fully merged profile to avoid wiping history/counters.",
    "Day bucketing uses a fixed -6h offset and does not apply the user’s onboarding timeZone or DST rules, so “today/yesterday” can be wrong for many users.",
    "currentDayCheckInStatus is always set to true on check-in/follow-up, so it cannot represent sober vs drank; derived status fields can be misleading.",
    "submitFollowUpCheckIn updates aggregatedEntries but does not update currentDayTotalDrinks, making returned/derived totals inconsistent.",
    "submitCheckIn’s currentDayTotalDrinks calculation is error-prone (fold logic can reset totals depending on entry order).",
    "getProgressMetrics computes streak based on current list order (reverse traversal) without sorting by date, so streak can be incorrect when entry order changes due to merge/remove/add behavior.",
    "ChanceOfDrinkingCard uses randomized placeholder logic (not data-driven), and CycleWindowCard uses a hardcoded 2026 full-moon table while applying the current year, producing incorrect moon countdowns outside 2026."
  ],
  "isFixRequest": true,
  "gameProjectType": "none",
  "projectName": "BRUTAL - Sobriety Tracking",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}