{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 8,
  "summary": "BRUTAL is an Internet Computer (ICP) dApp for alcohol reduction/sobriety tracking with a dark, “brutally honest” UX. Users authenticate via Internet Identity, complete an onboarding questionnaire to create a profile, then perform daily check-ins (sober/drank, drink count, mood). The backend aggregates check-ins per day, computes progress metrics and mood trend, serves a personalized sober-days target, and returns “Brutal Friend” feedback and motivation messages derived from a feedback matrix. The frontend presents a responsive dashboard with a 14‑day history chart, streak/target cards, daily status indicators, feedback + motivation dialogs, and follow-up check-ins for subsequent logins within the same day.",
  "existing_features": [
    {
      "id": "IF-1",
      "title": "Internet Identity authentication with persistent sessions",
      "synonyms": [
        "II login",
        "AuthClient authentication"
      ],
      "description": "Implements Internet Identity login/logout via `@dfinity/auth-client`, loads stored identities on app mount, tracks login status states, and supports clearing identity (logout). The login flow uses a configurable `II_URL` provider and sets long-lived delegations (30 days).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-2",
      "title": "Backend actor creation and lifecycle management",
      "synonyms": [
        "ICP actor hook",
        "useActor"
      ],
      "description": "Creates an authenticated or anonymous canister actor depending on whether the user is logged in. Initializes access control by calling `_initializeAccessControlWithSecret`, and invalidates/refetches all non-actor React Query queries whenever the actor changes (e.g., on login/logout).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-3",
      "title": "Role-based access control with admin secret bootstrap",
      "synonyms": [
        "AccessControl",
        "admin token gating"
      ],
      "description": "Motoko access control supports `#admin/#user/#guest` roles. The first principal to initialize with the correct secret (compared against `CAFFEINE_ADMIN_TOKEN`) becomes admin; others become users. Admins can assign roles; role checks gate all user endpoints.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-4",
      "title": "Onboarding questionnaire and profile persistence",
      "synonyms": [
        "OnboardingFlow",
        "UserProfile setup"
      ],
      "description": "Multi-step onboarding UI collects age range, drinks/week, motivation lens, secondary substance, and sobriety duration. The client detects browser time zone, derives baseline tier, maps motivation to backend enum, and saves a `UserProfile` marking onboarding complete. Robust connection readiness checks and retry/error UI are included.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-5",
      "title": "Onboarding and daily/follow-up check-in status API",
      "synonyms": [
        "Status gating",
        "checkOnboardingAndCheckInStatus"
      ],
      "description": "Backend provides a single status call returning `needsOnboarding`, `needsDailyCheckIn`, `isDailyCheckInCompleted`, `isFirstLoginOfDay`, `needsFollowUp`, and a computed `soberDaysTarget`. Frontend uses this to decide between onboarding and dashboard without flashing incorrect UI states.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-6",
      "title": "Daily check-in submission with mood and drink tracking",
      "synonyms": [
        "submitCheckIn",
        "DailyCheckInDialog"
      ],
      "description": "Daily check-in dialog is triggered only on first login of the day (session-guarded). Users report sober/drank, drink count, and mood. Backend aggregates entries per day, updates per-day totals/status, and returns a feedback message and metadata.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-7",
      "title": "Same-day follow-up check-in flow",
      "synonyms": [
        "FollowUpCheckInDialog",
        "submitFollowUpCheckIn"
      ],
      "description": "On subsequent logins during the same day, the app triggers a follow-up dialog offering: confirm remained sober (client-side feedback) or report additional drinks (backend mutation). Results update aggregated data and show a Brutal Friend message.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-8",
      "title": "Feedback matrix selection (backend) with JSON fallback (frontend)",
      "synonyms": [
        "Brutal Friend messages",
        "feedbackMatrix"
      ],
      "description": "Backend can store feedback matrix entries and selects a best match based on onboarding attributes (age range, motivation lens, baseline tier, optional substance). Frontend loads `/feedbackMatrix.json`, caches it, and searches for a matching message when backend returns an empty message or when generating client-side feedback.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-9",
      "title": "Latest Brutal Friend feedback retrieval and display",
      "synonyms": [
        "getLatestBrutalFriendFeedback",
        "Feedback card"
      ],
      "description": "Backend stores the last feedback message per user and exposes it via a query. Frontend displays it in dedicated cards/sections and also caches backend-provided messages after check-in mutations for immediate UI updates.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-10",
      "title": "Motivation button with daily click limit enforcement",
      "synonyms": [
        "getMotivationMessage",
        "3-per-day limit"
      ],
      "description": "Backend tracks motivation button clicks per day (max 3) and returns remaining clicks and limit status. Frontend shows motivation dialogs, disables the button when limit is reached, and falls back to the local feedback matrix if backend messaging fails or is empty.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-11",
      "title": "Progress metrics computation (streaks and totals)",
      "synonyms": [
        "getProgressMetrics",
        "streak tracking"
      ],
      "description": "Backend computes sober days, drank days, current sober streak, and total check-in count based on aggregated entries. Frontend consumes metrics to render progress sections such as streak and completion indicators.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-12",
      "title": "14-day drink history API and chart visualization",
      "synonyms": [
        "getLast14Days",
        "DrinksChart"
      ],
      "description": "Backend returns aggregated entries from the last 14 days. Frontend renders a responsive bar chart (Recharts) with normalized day labels, loading/updating states, and visual sync indicators when data changes.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-13",
      "title": "Mood trend calculation",
      "synonyms": [
        "getMoodTrend",
        "average mood"
      ],
      "description": "Backend computes an average mood score across check-ins (happy=2, neutral=1, sad=0) and exposes it via a query hook. Frontend has a hook to retrieve and display this metric (UI component referenced in summaries).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-14",
      "title": "Personalized sober-days target derived from onboarding",
      "synonyms": [
        "getSoberDaysTarget",
        "sobrietyDuration mapping"
      ],
      "description": "Backend maps `sobrietyDuration` answers (2/5 days, 1/2 weeks, 1 month) into a numeric sober-days target and exposes it via `getSoberDaysTarget`. Frontend displays target and progress against it in `SoberDaysSection`.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-15",
      "title": "Dashboard composition and status indicator widgets",
      "synonyms": [
        "Dashboard layout",
        "StatusIndicatorsSection"
      ],
      "description": "Dashboard composes the unified header (daily feedback + motivation), cycle window card (Friday/weekend + full moon countdown), a placeholder chance-of-drinking card, sober streak/target, status indicators (weekly average/yesterday/today), and embeds check-in dialogs for user flows. Includes logout clearing identity and query cache.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-16",
      "title": "Brutalist/neon design system and app metadata",
      "synonyms": [
        "Tailwind theme tokens",
        "OG/Twitter metadata"
      ],
      "description": "Tailwind config extends OKLCH theme tokens, neon glows, brutal shadows, and animations. `index.html` includes OpenGraph/Twitter metadata and app icons for deployment/publishing. UI uses uppercase typography and sharp borders consistent with the BRUTAL brand.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "feature-add-a-frontend-only-feedback-matrix-inspector-view-that-loads-frontend-public-feedbackmatrix-json-via-the-existing-loadfeedbackmatrix-loader-and-displays-for-each-unique-user-input-combination-how-many-feedback-messages-exist-in-the-matrix",
      "title": "Add a frontend-only “Feedback Matrix Inspector” view that loads `frontend/public/feedbackMatrix.json` via the existing `loadFeedbackMatrix()` loader and displays, for each unique user-input combination, how many feedback messages exist in the matrix.",
      "reqIds": [
        "REQ-1"
      ],
      "version": 1
    },
    {
      "id": "feature-in-the-feedback-matrix-inspector-also-display-a-per-entry-sentence-count-for-each-message-computed-on-the-frontend-by-splitting-the-message-text-into-sentences-and-a-per-group-total-sentence-count",
      "title": "In the Feedback Matrix Inspector, also display a per-entry sentence count for each message (computed on the frontend by splitting the message text into sentences) and a per-group total sentence count.",
      "reqIds": [
        "REQ-2"
      ],
      "version": 1
    },
    {
      "id": "feature-provide-a-safe-way-to-access-the-feedback-matrix-inspector-from-the-app-without-modifying-authentication-internals-add-a-minimal-route-or-conditional-rendering-entry-point-for-example-a-debug-feedback-matrix-route-or-a-debug-feedback-matrix-flag-and-ensure-it-does-not-appear-in-normal-user-flow-by-default",
      "title": "Provide a safe way to access the Feedback Matrix Inspector from the app without modifying authentication internals: add a minimal route or conditional rendering entry point (for example, a `#/debug/feedback-matrix` route or a `?debug=feedback-matrix` flag) and ensure it does not appear in normal user flow by default.",
      "reqIds": [
        "REQ-3"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [],
  "architecturalNotes": [
    "ICP canister backend written in Motoko with state stored in a `Map<Principal, PersistentUserProfile>` and check-ins stored as `List<AggregatedEntry>` per user.",
    "Backend uses an explicit migration entrypoint: `(with migration = Migration.run) actor { ... }`, allowing schema evolution (e.g., `currentDayCheckInStatus` changed from `Bool` to a record).",
    "Authorization implemented via an `AccessControlState` and a mixin (`MixinAuthorization`) that exposes role queries and role assignment; first admin assignment is gated by a shared secret compared against the `CAFFEINE_ADMIN_TOKEN` environment variable.",
    "Frontend is React + TypeScript using `@tanstack/react-query` for data fetching, caching, retries, and mutation-driven invalidation (e.g., invalidating `last14Days`, `progressMetrics`, `moodTrend`, and feedback queries after check-ins).",
    "A dedicated `useActor` hook creates the backend actor (anonymous or authenticated), initializes access control, and invalidates/refetches all dependent queries when the actor changes.",
    "Onboarding and check-in gating is driven by a single backend status call (`checkOnboardingAndCheckInStatus`) to avoid UI flashes and to trigger daily/follow-up dialogs.",
    "Feedback/motivation content is backed by a server-side feedback matrix (admin-addable) and a client-side JSON fallback (`/feedbackMatrix.json`) loaded and cached by `feedbackMatrixLoader.ts`.",
    "UI uses Tailwind (with custom OKLCH theme tokens and neon/brutalist utilities) and shadcn-style components; dialogs use session-level `useRef` guards to prevent duplicate openings during a session.",
    "The app extracts a sensitive admin token from the URL hash fragment (`caffeineAdminToken`), persists it in `sessionStorage`, and clears it from the URL to reduce leakage risks."
  ],
  "knownIssues": [
    "`frontend/src/index.css` appears twice in the provided codebase with conflicting CSS variable/theme definitions (one BRUTAL neon theme, one default shadcn-like theme). This can cause styling conflicts depending on build resolution.",
    "`ChanceOfDrinkingCard` uses randomized placeholder logic rather than real risk assessment derived from user data or backend predictions.",
    "Start-of-day normalization uses a fixed 6-hour offset (`21_600_000` ms) in both frontend and backend; user time zone is collected/stored but not used for day boundaries, which can misclassify check-ins across time zones/DST.",
    "Backend `feedbackMatrix` is initialized empty and only supports adding entries one-by-one via an admin method; there is no exposed bulk-load or default seeding, so production behavior may rely heavily on the frontend JSON fallback.",
    "Backend `submitCheckIn` computes `isFollowUp` from the newly written `currentDayCheckInStatus`, making it effectively always `true` for that call; follow-up detection likely needs to be based on the pre-existing status before updating.",
    "`backend/migration.mo` sets `numberOfChecks` using `oldProfile.currentDayTotalDrinks`, which is semantically incorrect (drinks != number of check-ins) and may corrupt migrated counters.",
    "`useGetProgressMetrics` on the frontend types the response without `last14Days`, while the backend returns it; not harmful at runtime but indicates a contract mismatch/unused payload.",
    "Some React Query hooks swallow backend errors by returning defaults (e.g., `useGetLast14Days` returns `[]` on error), which can hide operational issues and complicate debugging.",
    "Feedback/motivation selection is repeatedly returning the same message (random selection not behaving as expected), likely due to caching, deterministic selection, or lack of proper randomization/seed in feedbackMatrix lookup.",
    "User reports the in-app code editor/file panel is in read-only mode, preventing manual edits to files like `frontend/public/feedbackMatrix.json`."
  ],
  "isFixRequest": false,
  "gameProjectType": "none",
  "projectName": "BRUTAL - Sobriety Tracking",
  "clarification_mode": "instant",
  "clarification_rounds": 0,
  "requiresBackendChanges": false,
  "requiresFrontendChanges": true
}