{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "BRUTAL is a React (TypeScript) + Motoko Internet Computer (ICP) sobriety/alcohol-reduction tracker with a neon/brutalist UI. Users authenticate via Internet Identity, complete a multi-step onboarding questionnaire (including browser-detected time zone), and then log daily check-ins capturing sober/drank status, drink count, and mood. The Motoko canister persists per-user profiles, aggregates check-ins into per-day summaries, computes progress metrics and mood trend, tracks same-day repeat check-ins (reasons), and serves “brutal friend” feedback plus rate-limited motivation messages. The frontend uses TanStack React Query for typed data access with retries and cache invalidation, and drives a centralized daily modal/session flow (FIFO queue) for daily check-in or repeat check-in, followed by a “data logged” confirmation and brutal feedback.",
  "existing_features": [
    {
      "id": "IF-1",
      "title": "Internet Identity authentication with persistent session loading",
      "synonyms": [
        "II login",
        "AuthClient integration",
        "delegation persistence"
      ],
      "description": "Provides login/logout via Internet Identity, loads an existing authenticated session on mount, validates delegations, and exposes identity and login lifecycle flags through a React context hook.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-2",
      "title": "Backend canister actor creation and lifecycle management",
      "synonyms": [
        "useActor",
        "actor caching",
        "authenticated/anonymous actor"
      ],
      "description": "Creates an anonymous actor when logged out and an authenticated actor when logged in; after actor creation it bootstraps access control via a secret and invalidates/refetches React Query caches when the actor changes.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-3",
      "title": "Secure URL-hash secret parsing and session persistence",
      "synonyms": [
        "admin token handling",
        "hash secret",
        "sessionStorage secret"
      ],
      "description": "Extracts sensitive parameters (e.g., admin bootstrap token) from the URL hash fragment, persists them in sessionStorage, and clears them from the URL to reduce leakage risk.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-4",
      "title": "Role-based access control with admin bootstrap token",
      "synonyms": [
        "AccessControl",
        "authorization mixin",
        "admin/user/guest roles"
      ],
      "description": "Implements Motoko role management (admin/user/guest). Admin is assigned via a secret token matched against an env var; exposes APIs to query the caller role, check admin status, and assign roles (admin-only).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-5",
      "title": "Persistent user profile model with onboarding answers and activity fields",
      "synonyms": [
        "PersistentUserProfile",
        "profile persistence",
        "onboardingAnswers"
      ],
      "description": "Stores a per-user profile including onboarding answers (with time zone), completion flag, last check-in markers, aggregated daily entries, repeat check-ins, brutal feedback, and motivation click counters.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-6",
      "title": "Onboarding questionnaire wizard with progress indicator and time zone detection",
      "synonyms": [
        "setup flow",
        "multi-step onboarding",
        "timezone detection"
      ],
      "description": "Guides first-time users through a multi-step questionnaire, auto-advances on selection, detects browser time zone, shows connection/saving/error states, and saves the completed profile to the canister.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-7",
      "title": "Onboarding and daily-status backend API for flow gating",
      "synonyms": [
        "checkOnboardingAndCheckInStatus",
        "daily status flags",
        "dailyCheckInsToday"
      ],
      "description": "Backend exposes a status object containing onboarding requirement, daily check-in requirement, follow-up signal, and today’s check-in count; frontend uses it to decide which session flow to start.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-8",
      "title": "Daily check-in submission and per-day aggregation",
      "synonyms": [
        "submitCheckIn",
        "AggregatedEntry merging",
        "day bucketing"
      ],
      "description": "Submits daily check-ins (sober/drinks/mood), normalizes to a day bucket, merges multiple check-ins for the same day (sum drinks, increment checkInCount), updates profile markers, and returns a brutal feedback message.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-9",
      "title": "Daily check-in dialog (controlled modal) with validation",
      "synonyms": [
        "DailyCheckInDialog",
        "daily modal",
        "sober/drinks/mood form"
      ],
      "description": "A fully controlled modal that collects sobriety status, drink count (when applicable), and mood; validates inputs and calls an externally supplied submit handler. It contains no self-triggering modal logic.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-10",
      "title": "Repeat check-in event logging with reason taxonomy",
      "synonyms": [
        "submitRepeatCheckIn",
        "repeatCheckIns",
        "same-day reflection"
      ],
      "description": "Allows users to log a same-day repeat check-in with a structured reason (reflection/urge/bored/habit/curiosity) stored in the profile as a separate event stream from drink follow-ups.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-11",
      "title": "Repeat check-in dialog (“Why are you back so soon?”)",
      "synonyms": [
        "RepeatCheckInDialog",
        "repeat session modal"
      ],
      "description": "Controlled modal that prompts the user to select a repeat-check-in reason from predefined options with descriptions and icons, then submits it via an external handler.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-12",
      "title": "Follow-up check-in to add more drinks after a prior check-in",
      "synonyms": [
        "submitFollowUpCheckIn",
        "FollowUpCheckInDialog",
        "same-day drink update"
      ],
      "description": "Backend API to append a same-day follow-up entry (additional drinks) and update brutal feedback; frontend provides a controlled dialog to confirm sobriety or submit additional drinks.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-13",
      "title": "Centralized daily session flow state machine",
      "synonyms": [
        "dailySessionFlow",
        "SessionPhase resolver",
        "session controller"
      ],
      "description": "Implements a deterministic resolver that maps status into a single SessionPhase (ONBOARDING/FIRST_CHECKIN/REPEAT_CHECKIN/IDLE) and provides state helpers to start, advance, and end a session flow.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-14",
      "title": "Single-modal FIFO queue for daily session dialogs",
      "synonyms": [
        "modal queue",
        "DailyCheckIn → DataLogged → BrutalFriend",
        "repeat queue"
      ],
      "description": "Generates a FIFO modal queue from the SessionPhase to ensure only one modal is open at any time. Dashboard advances the queue via centralized close handlers and displays the corresponding controlled dialogs.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-15",
      "title": "“Data Logged” confirmation dialog with primary/secondary variants",
      "synonyms": [
        "DataLoggedDialog",
        "post-submit confirmation"
      ],
      "description": "Controlled confirmation modal that displays a feedback message after a daily or repeat check-in, with a variant label to distinguish first check-in vs same-day update.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-16",
      "title": "Brutal Friend feedback generation and display (backend + frontend fallback)",
      "synonyms": [
        "getLatestBrutalFriendFeedback",
        "BrutalFriendDialog",
        "fallback quote pool"
      ],
      "description": "Backend generates and stores a “brutal friend” message; frontend fetches and displays it in dashboard cards and dialogs, falling back to a local pool of quotes when no message is available.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-17",
      "title": "Motivation message API with daily click limit and UI controls",
      "synonyms": [
        "getMotivationMessage",
        "Need Motivation button",
        "3-per-day limit"
      ],
      "description": "Backend returns a motivation message with remaining-click tracking and a daily limit; frontend exposes a button that fetches messages via mutation and displays them in a dialog while disabling when the limit is reached.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-18",
      "title": "Progress metrics computation and dashboard stat components",
      "synonyms": [
        "getProgressMetrics",
        "ProgressStats",
        "SoberDaysSection"
      ],
      "description": "Backend computes sober days, drank days, current streak, and total check-ins; frontend renders multiple stat/summary cards and a sober-streak vs target section (target derived from onboarding).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-19",
      "title": "Recent history retrieval and 14-day drinks chart",
      "synonyms": [
        "getLast14Days",
        "DrinksChart",
        "update highlighting"
      ],
      "description": "Backend serves recent aggregated entries; frontend renders a 14-day bar chart using consistent day normalization and shows loading/updating/synced indicators based on fetch state and data changes.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-20",
      "title": "Derived weekly/yesterday/today status indicators from aggregated history",
      "synonyms": [
        "StatusIndicatorsSection",
        "weekly average card",
        "today/yesterday cards"
      ],
      "description": "Computes and displays simple drinking-status labels (Sober/Few Drinks/Drunk/Not Sure) for weekly average, yesterday, and today based on aggregated entries using the same day bucketing logic.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-21",
      "title": "Mood tracking and mood trend endpoint with UI indicator",
      "synonyms": [
        "Mood enum",
        "getMoodTrend",
        "MoodIndicator"
      ],
      "description": "Check-ins can include mood (happy/neutral/sad). Backend provides a basic averaged mood trend metric; frontend shows the most recent mood in a styled indicator card.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-22",
      "title": "App-level routing, resilient startup states, and error boundary",
      "synonyms": [
        "App.tsx gating",
        "connection timeouts",
        "GlobalErrorBoundary"
      ],
      "description": "App gates views by authentication, actor readiness, and onboarding status; includes loading timeouts, connection retry tracking, toasts on failures, and a global error boundary to avoid blank screens.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-23",
      "title": "Neon/brutalist design system (Tailwind + shadcn primitives)",
      "synonyms": [
        "OKLCH theme tokens",
        "brutal-card utilities",
        "neon glow"
      ],
      "description": "Defines a consistent brutalist dark theme using OKLCH CSS variables, Tailwind extensions (shadows/animations), and reusable UI primitives (Dialog/Card/Button) across the app.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-24",
      "title": "Canister state migration for schema evolution",
      "synonyms": [
        "migration.mo",
        "repeatCheckIns migration"
      ],
      "description": "Includes a migration that transforms older stored user profile state into the new schema by adding repeatCheckIns and preserving existing profile fields.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "feature-fix-the-dashboard-s-centralized-daily-session-flow-initialization-so-the-expected-modal-popups-daily-check-in-repeat-check-in-followed-by-data-logged-and-brutal-friend-reliably-appear-when-the-backend-status-indicates-they-are-needed-including-when-userprofile-loads-after-status",
      "title": "Fix the Dashboard’s centralized daily session flow initialization so the expected modal popups (Daily Check-In / Repeat Check-In, followed by Data Logged and Brutal Friend) reliably appear when the backend status indicates they are needed, including when `userProfile` loads after `status`.",
      "reqIds": [
        "REQ-1"
      ],
      "version": 1
    },
    {
      "id": "feature-ensure-user-facing-fallback-behavior-exists-when-no-session-modal-is-triggered-phase-idle-so-users-can-still-access-check-in-actions-e-g-a-clearly-labeled-manual-button-or-entry-point-on-the-dashboard-without-relying-on-auto-popups",
      "title": "Ensure user-facing fallback behavior exists when no session modal is triggered (phase IDLE), so users can still access check-in actions (e.g., a clearly labeled manual button or entry point on the Dashboard) without relying on auto-popups.",
      "reqIds": [
        "REQ-2"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Centralize all modal/popup orchestration via a single Daily Session Flow controller (SessionPhase resolver + deterministic popup FIFO queue) so onboarding/first-checkin/repeat-checkin/data-logged/friend-feedback run exactly once per session in order and never self-trigger.",
      "reqIds": [],
      "status": "pending"
    }
  ],
  "architectural_notes": [
    "Frontend is a React SPA using TanStack React Query for typed queries/mutations, retries, caching, and targeted invalidation.",
    "Authentication uses Internet Identity via a dedicated provider/hook that loads persisted delegations and exposes login lifecycle flags.",
    "Backend access uses a generated ICP canister actor created in a custom hook (useActor), keyed by principal, with dependent-query invalidation when the actor changes.",
    "Backend is a Motoko canister with a Principal-keyed Map of user profiles and List-based storage for aggregatedEntries/repeatCheckIns.",
    "Authorization is implemented as an AccessControl module plus a Motoko mixin exposing role APIs and an admin bootstrap via an env token.",
    "Daily “session dialogs” are orchestrated by a deterministic state machine (SessionPhase + ModalType) and a FIFO modal queue to ensure a single visible modal at a time.",
    "Day bucketing is normalized using a fixed 6-hour offset on both backend and frontend to align charting/status computations.",
    "UI uses Tailwind + shadcn/Radix-style primitives (Dialog/Card/Button) with an OKLCH token-based neon/brutalist theme.",
    "Canister state evolution is handled with a migration module that maps older stored profile formats to the new schema.",
    "Numeric canister types (Nat/Nat64) are represented as bigint in the frontend and converted to number for display."
  ],
  "known_issues": [
    "useCheckOnboardingAndCheckInStatus can execute with an anonymous actor (hook runs regardless of auth), causing backend traps (“Unauthorized”) and noisy errors before login.",
    "saveCallerUserProfile replaces the entire stored profile; if reused for partial edits later, it can accidentally overwrite/erase historical aggregatedEntries and counters.",
    "currentDayCheckInStatus is set to ?true for both sober and drinking check-ins, so it does not actually represent sober vs drank; fields like lastLoginWasSober become unreliable.",
    "Follow-up handling is incomplete: needsFollowUp is computed for same-day logins, but the frontend follow-up dialog is not triggered from status and “remained sober” does not persist any backend state, so prompts/logic can be inconsistent.",
    "currentDayTotalDrinks is inconsistently maintained: submitCheckIn computes totals in a way that can double-count/miscount, and submitFollowUpCheckIn does not update currentDayTotalDrinks at all.",
    "getProgressMetrics returns last14Days as the full entries array (not limited to 14) and does not sort by date; streak and “most recent mood” derived from array order may be incorrect.",
    "Time zone is collected during onboarding but not used for day normalization; the fixed 6-hour offset ignores user time zones and DST.",
    "Dashboard’s session flow phase is resolved only once per mount (hasInitialized gate) and is not re-resolved after dialogs close or after later state changes, which can miss transitions without reload.",
    "getMotivationMessage initializes a new profile and sets lastCheckInDate/currentDayCheckInStatus to “today”, which can interfere with daily check-in gating for new users.",
    "CycleWindowCard uses a hardcoded 2026 full-moon table but applies the current year, making results incorrect outside that dataset (and the table itself is incomplete)."
  ],
  "isFixRequest": true,
  "gameProjectType": "none",
  "projectName": "BRUTAL - Sobriety Tracking",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}