{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 14,
  "summary": "BRUTAL is a React (TypeScript) + Motoko (Internet Computer) sobriety/alcohol-reduction tracking app with a neon/brutalist UI. Users authenticate via Internet Identity, complete a multi-step onboarding questionnaire (including browser-detected time zone), then log daily check-ins capturing sober/drank status, drink count, and mood. The Motoko canister maintains per-user profiles, aggregates check-ins into per-day summaries, computes progress metrics (sober days, drunk days, streak, total check-ins) and mood trend, stores and serves “brutal friend” feedback messages, and provides a rate-limited motivation message endpoint. The frontend uses TanStack React Query for typed queries/mutations with retries and cache invalidation, and orchestrates daily modal popups through a deterministic session-flow state machine (auto-starting only the first daily check-in, while repeat check-ins require an explicit manual trigger).",
  "existing_features": [
    {
      "id": "IF-1",
      "title": "Internet Identity authentication",
      "synonyms": [
        "II login",
        "AuthClient integration"
      ],
      "description": "Provides login/logout and restores an existing authenticated session using @dfinity/auth-client, exposing identity and login lifecycle status via a React context hook.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-2",
      "title": "Canister actor creation (anonymous/authenticated) with authorization bootstrap",
      "synonyms": [
        "useActor",
        "actor lifecycle"
      ],
      "description": "Creates an anonymous actor when logged out and an authenticated actor when logged in; authenticated actor creation calls _initializeAccessControlWithSecret and triggers query invalidation/refetch when the actor changes.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-3",
      "title": "Secure secret extraction from URL hash with session persistence",
      "synonyms": [
        "hash secret parsing",
        "sessionStorage secret"
      ],
      "description": "Extracts sensitive parameters (e.g., caffeineAdminToken) from the URL hash fragment, persists them in sessionStorage, and removes them from the URL to reduce leakage risk.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-4",
      "title": "Role-based access control with admin bootstrap token",
      "synonyms": [
        "AccessControl",
        "authorization mixin"
      ],
      "description": "Implements per-principal roles (admin/user/guest). First-time principals are registered via initialization; admin assignment is gated by a secret token matched against CAFFEINE_ADMIN_TOKEN; exposes APIs to query role, check admin status, and assign roles (admin-only).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-5",
      "title": "Persistent user profile model (canister-side)",
      "synonyms": [
        "PersistentUserProfileView",
        "onboardingAnswers"
      ],
      "description": "Stores onboarding answers (including timeZone), onboarding completion flag, last check-in markers, aggregated day entries, repeat check-ins, daily totals, latest brutal friend feedback, and motivation click counters.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-6",
      "title": "Onboarding questionnaire wizard with time zone detection",
      "synonyms": [
        "OnboardingFlow",
        "setup wizard"
      ],
      "description": "Guides users through a multi-step questionnaire with progress display and auto-advance; detects browser time zone, handles connection/saving/error states, and saves the completed profile to the canister.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-7",
      "title": "Onboarding and daily check-in status API for UI flow gating",
      "synonyms": [
        "checkOnboardingAndCheckInStatus",
        "dailyCheckInsToday"
      ],
      "description": "Backend returns a status object including onboarding required flags and daily check-in counters; frontend uses this to decide whether to show onboarding, auto-start first daily check-in, or allow repeat check-ins via manual trigger.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-8",
      "title": "Daily check-in submission with per-day aggregation",
      "synonyms": [
        "submitCheckIn",
        "AggregatedEntry merge"
      ],
      "description": "Submits a check-in containing sober/drank status, drinks, and optional mood; backend normalizes to a day bucket and merges multiple same-day check-ins into an aggregated per-day entry.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-9",
      "title": "Daily check-in modal UI with validation and mood selection",
      "synonyms": [
        "DailyCheckInDialog",
        "daily modal"
      ],
      "description": "Controlled dialog that collects sobriety status, drink count (when not sober), and mood (happy/neutral/sad), validates required fields, and resets local form state on close/submit.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-10",
      "title": "Follow-up check-in endpoint and UI",
      "synonyms": [
        "submitFollowUpCheckIn",
        "FollowUpCheckInDialog"
      ],
      "description": "Backend endpoint allows adding additional drinks to today's aggregated entry; frontend provides a controlled follow-up dialog UI (though not currently auto-triggered from status).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-11",
      "title": "Repeat check-in (\"Back so soon\") UI and flow using follow-up submission",
      "synonyms": [
        "RepeatCheckInDialog",
        "same-day follow-up"
      ],
      "description": "Repeat check-in dialog asks whether the user is still sober; if not, prompts for drink count and submits via submitFollowUpCheckIn; if still sober, ends the flow without submission.",
      "reqIds": [
        "REQ-4"
      ],
      "version": 1
    },
    {
      "id": "IF-12",
      "title": "Prevention of repeat-checkin auto-popup loops; manual repeat trigger",
      "synonyms": [
        "auto-start guard",
        "manual Start Check-In"
      ],
      "description": "Dashboard auto-starts only the FIRST_CHECKIN flow once per session (guarded by a ref) and requires explicit user action via “Start Check-In” to initiate repeat check-ins, preventing repeat-modal loops after status refresh.",
      "reqIds": [
        "REQ-3"
      ],
      "version": 1
    },
    {
      "id": "IF-13",
      "title": "Progress metrics computation and dashboard stat cards",
      "synonyms": [
        "getProgressMetrics",
        "ProgressStats",
        "SoberDaysSection"
      ],
      "description": "Backend computes sober days, drunk days, current streak, and total check-ins; frontend renders these in brutalist stat cards and a streak/target section (target derived from onboarding sobrietyDuration).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-14",
      "title": "14-day history retrieval and bar chart visualization",
      "synonyms": [
        "getLast14Days",
        "DrinksChart"
      ],
      "description": "Fetches recent aggregated entries and renders a 14-day bar chart with normalized day labels and visual synced/updating indicators.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-15",
      "title": "Derived status indicators (weekly average, yesterday, today)",
      "synonyms": [
        "StatusIndicatorsSection",
        "weekly average card"
      ],
      "description": "Computes and displays weekly average drinking status and yesterday/today status by matching normalized day buckets against aggregated chart data.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-16",
      "title": "Mood tracking and mood trend retrieval",
      "synonyms": [
        "Mood enum",
        "getMoodTrend",
        "MoodIndicator"
      ],
      "description": "Check-ins can include mood; backend exposes a mood trend metric; frontend includes a mood indicator widget based on recent history from progress metrics.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-17",
      "title": "Brutal Friend feedback generation, storage, and display",
      "synonyms": [
        "getLatestBrutalFriendFeedback",
        "BrutalFriendDialog",
        "UnifiedHeaderSection"
      ],
      "description": "Backend generates and stores a brutal feedback message and serves the latest message; frontend displays it in a unified header card and in a dialog with local fallback messages.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-18",
      "title": "Motivation message endpoint with daily click limit and UI",
      "synonyms": [
        "getMotivationMessage",
        "MotivationButton",
        "Need Motivation"
      ],
      "description": "Backend returns a motivation message with remaining-click tracking and a 3-per-day limit; frontend provides buttons that fetch messages, show them in a dialog, and disable when the limit is reached.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-19",
      "title": "Centralized daily session flow controller (state machine + FIFO modal queue)",
      "synonyms": [
        "dailySessionFlow",
        "SessionPhase",
        "ModalType queue"
      ],
      "description": "Implements deterministic session phase resolution and generates a FIFO modal queue to ensure ordered, single-at-a-time daily popups (check-in → data logged → brutal friend).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-20",
      "title": "App-level routing/gating with resilient loading and timeout fallbacks",
      "synonyms": [
        "App.tsx gating",
        "connection timeouts"
      ],
      "description": "Routes between Login, Onboarding, and Dashboard based on authentication, actor readiness, and status; includes timeouts and error toasts to avoid indefinite spinners on slow/failing backend calls.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-21",
      "title": "Global error boundary with reload recovery",
      "synonyms": [
        "GlobalErrorBoundary",
        "crash recovery"
      ],
      "description": "Catches uncaught render errors, logs details, and renders a recovery UI with a reload action and optional error details.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-22",
      "title": "Auxiliary dashboard widgets (cycle window and risk placeholder)",
      "synonyms": [
        "CycleWindowCard",
        "ChanceOfDrinkingCard"
      ],
      "description": "Displays auxiliary widgets including days-until-Friday/weekend messaging, a full-moon countdown, and a placeholder randomized “chance of drinking tomorrow” risk level.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-23",
      "title": "Neon/brutalist theme system and UI primitives",
      "synonyms": [
        "Tailwind theme",
        "OKLCH tokens",
        "shadcn UI"
      ],
      "description": "Defines a consistent brutalist dark theme via OKLCH CSS variables, Tailwind extensions (neon shadows/animations), and reusable dialog/card/button primitives.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "feature-update-the-sign-in-page-to-display-the-app-name-text-brutal-in-a-prominent-on-brand-way-e-g-as-a-heading-near-the-existing-logo-title-without-altering-or-re-laying-out-any-other-existing-sign-in-page-content-beyond-what-is-necessary-to-insert-the-name",
      "title": "Update the sign-in page to display the app name text \"BRUTAL\" in a prominent, on-brand way (e.g., as a heading near the existing logo/title), without altering or re-laying out any other existing sign-in page content beyond what is necessary to insert the name.",
      "reqIds": [
        "REQ-5"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Add the app name \"BRUTAL\" somewhere on the sign-in page without changing anything else on that page",
      "reqIds": [],
      "status": "pending"
    }
  ],
  "architectural_notes": [
    "Frontend is a React SPA using TanStack React Query for data fetching, caching, retries, and invalidation-driven refresh.",
    "Authentication uses Internet Identity via @dfinity/auth-client wrapped in a React context provider, with stored delegation loading on mount.",
    "Backend access is encapsulated in a useActor hook that creates anonymous or authenticated canister actors and bootstraps authorization on authenticated actor creation.",
    "Backend authorization uses an AccessControl module + Motoko mixin; admin bootstrap is gated by a secret compared against an env var (CAFFEINE_ADMIN_TOKEN).",
    "Daily UI popups are modeled as a deterministic state machine (SessionPhase) producing a FIFO modal queue (ModalType) with helpers to start/advance/end flows.",
    "A fixed 6-hour offset day-normalization function is implemented both in backend and frontend for day bucketing and UI labels.",
    "Backend exposes typed endpoints for onboarding/check-in status, profile CRUD, check-in submission, metrics, mood trend, feedback, and motivation messages.",
    "UI is built with Tailwind + shadcn/Radix-style primitives (Dialog/Card/Button/Input), with centralized OKLCH theme tokens and neon/brutalist utility styles.",
    "Global error handling uses a top-level React error boundary and toast notifications (sonner) for async failures.",
    "Repository now includes a reusable build-template for React (Vite/TS) + Motoko canisters with pnpm workspace setup, Dockerfile, deploy.sh, and icp.yaml for standardized build/deploy."
  ],
  "known_issues": [
    "useActor returns an anonymous actor when logged out; status/profile queries are enabled when the anonymous actor is ready, causing canister calls to trap with Unauthorized and generating noisy errors before login.",
    "Backend stores userProfiles and access control state in non-stable in-memory structures; state will be lost on canister upgrade/reinstall.",
    "saveCallerUserProfile overwrites the entire stored profile document; callers must include all fields (including history/counters) or risk unintentional data loss during updates.",
    "Backend currentDayCheckInStatus is always set to ?true on submitCheckIn/submitFollowUpCheckIn, so it cannot represent sober vs not-sober and makes fields like lastLoginWasSober conceptually unreliable.",
    "Backend currentDayTotalDrinks logic in submitCheckIn is error-prone (fold behavior can reset totals) and submitFollowUpCheckIn does not update currentDayTotalDrinks, leading to inconsistent drink totals.",
    "Backend status exposes needsFollowUp but the Dashboard never sets showFollowUp based on that status, so the follow-up dialog is not automatically triggered.",
    "getProgressMetrics returns last14Days as the full entries array (not limited to 14 days) and streak calculation depends on entry ordering without an explicit sort.",
    "Time zone is captured during onboarding and can be queried, but day bucketing uses a fixed offset and does not apply the user’s actual time zone/DST.",
    "CycleWindowCard uses a hardcoded 2026 full-moon table (and appears incomplete) while applying the current year, producing incorrect results.",
    "On identity changes, useActor invalidates and refetches essentially all non-actor queries, which may cause refetch bursts and unnecessary backend load."
  ],
  "isFixRequest": false,
  "gameProjectType": "none",
  "projectName": "BRUTAL - Sobriety Tracking",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}