{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "BRUTAL is a React + Motoko Internet Computer (ICP) application for alcohol reduction/sobriety tracking with a neon/brutalist UI. Users authenticate via Internet Identity, complete a multi-step onboarding questionnaire (including browser-detected time zone), and then perform daily check-ins capturing sober/drank status, drink count, and mood. A Motoko canister stores per-user profiles and per-day aggregated check-ins, computes progress metrics (sober days, drank days, streak, total check-ins), provides mood trend and last-14-days history, and generates “brutal friend” feedback plus rate-limited motivation messages. The dashboard surfaces these metrics and status cards, and drives check-in/onboarding flow based on backend status flags.",
  "existing_features": [
    {
      "id": "IF-1",
      "title": "Internet Identity authentication & session persistence",
      "synonyms": [
        "II login",
        "AuthClient integration",
        "Identity provider"
      ],
      "description": "Provides login/logout via Internet Identity, loads an existing authenticated session on mount, and exposes identity plus detailed login lifecycle flags through a React context hook.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-2",
      "title": "Canister actor creation (anonymous or authenticated) with caching",
      "synonyms": [
        "useActor",
        "backend connection hook",
        "actor initialization"
      ],
      "description": "Creates an anonymous actor when logged out and an authenticated actor when logged in; caches the actor via React Query keyed by principal and invalidates/refetches non-actor queries when the actor changes.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-3",
      "title": "Role-based access control with secret bootstrap",
      "synonyms": [
        "authorization mixin",
        "admin/user/guest roles",
        "AccessControl"
      ],
      "description": "Motoko access control assigns roles during initialization (admin when the provided secret matches the canister’s admin token; otherwise user). Exposes APIs to get caller role, check admin, and assign roles (admin-only).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-4",
      "title": "Secure secret parameter handling via URL hash + sessionStorage",
      "synonyms": [
        "URL hash secret parsing",
        "caffeineAdminToken handling",
        "session token persistence"
      ],
      "description": "Extracts sensitive parameters from the URL hash, persists them in sessionStorage for the session, and removes them from the URL to reduce leakage risk; used to pass an admin bootstrap secret during actor initialization.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-5",
      "title": "React Query API layer for profiles, status, metrics, and check-ins",
      "synonyms": [
        "useQueries",
        "TanStack Query hooks",
        "query invalidation"
      ],
      "description": "Implements typed query/mutation hooks for backend operations with actor-readiness gating, consistent retry behavior, error logging, and query invalidation after mutations (profile saves, check-ins, follow-ups).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-6",
      "title": "Onboarding questionnaire (multi-step) with progress UI and timezone detection",
      "synonyms": [
        "setup wizard",
        "onboarding flow",
        "UserProfile onboarding"
      ],
      "description": "Multi-step onboarding collects baseline answers (age range, drinks/week, motivation, secondary substance, sobriety duration), detects browser time zone, shows connection/saving status, and persists the profile to the backend.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-7",
      "title": "Onboarding + daily check-in status endpoint and gating",
      "synonyms": [
        "checkOnboardingAndCheckInStatus",
        "needsDailyCheckIn",
        "first login flow"
      ],
      "description": "Backend computes flags for onboarding completion and daily check-in needs. Frontend uses these flags to decide between onboarding vs dashboard and to trigger check-in/follow-up dialogs.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-8",
      "title": "Daily check-in capture (sober/drinks/mood) with feedback flow",
      "synonyms": [
        "DailyCheckInDialog",
        "submitCheckIn",
        "daily modal"
      ],
      "description": "Modal prompts for sober vs drank, drink count (if drank), and mood selection; uses session guards to prevent duplicate openings; generates a local feedback line and then shows backend-provided brutal-friend feedback after submission.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-9",
      "title": "Follow-up check-in for additional drinks later the same day",
      "synonyms": [
        "FollowUpCheckInDialog",
        "submitFollowUpCheckIn",
        "same-day update"
      ],
      "description": "When backend indicates a follow-up is needed, prompts the user to confirm sobriety or add more drinks for the day; submits additional drinks and shows feedback plus a brutal-friend message when applicable.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-10",
      "title": "Per-day aggregation and last-14-days retrieval",
      "synonyms": [
        "AggregatedEntry",
        "getLast14Days",
        "daily bucketing"
      ],
      "description": "Backend normalizes timestamps into day buckets and merges multiple check-ins for the same day (sum drinks, combine sober state, update mood, increment check-in count). Provides a last-14-days aggregated history used for charting and status sections.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-11",
      "title": "Progress metrics and streak computation",
      "synonyms": [
        "getProgressMetrics",
        "ProgressStats",
        "streak tracking"
      ],
      "description": "Backend computes sober days, drank days, current streak, and total check-ins; frontend converts bigints safely and renders themed stat cards with loading skeletons.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-12",
      "title": "Mood trend and recent mood display",
      "synonyms": [
        "getMoodTrend",
        "MoodIndicator",
        "mood average"
      ],
      "description": "Check-ins include an optional mood (happy/neutral/sad). Backend computes a simple average mood trend; frontend displays the most recent mood from history and supports loading states.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-13",
      "title": "Brutal Friend feedback generation, storage, and display",
      "synonyms": [
        "getLatestBrutalFriendFeedback",
        "BrutalFriendDialog",
        "feedback cards"
      ],
      "description": "Backend generates sarcastic feedback and stores the latest per user. Frontend fetches and displays it on the dashboard and in dialogs with safe string handling and fallbacks.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-14",
      "title": "Motivation messages with daily click limit",
      "synonyms": [
        "getMotivationMessage",
        "Need Motivation button",
        "rate limit"
      ],
      "description": "Backend provides motivation messages with a per-user daily limit (3/day) tracked by day bucket counters. Frontend requests messages via a mutation and displays them in a BrutalFriendDialog, showing remaining clicks/limit reached states.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-15",
      "title": "Dashboard visualization and derived status cards",
      "synonyms": [
        "DrinksChart",
        "StatusIndicatorsSection",
        "dashboard layout"
      ],
      "description": "Dashboard composes unified header (feedback + motivation), placeholder risk and cycle cards, sober streak/target section, today/yesterday/weekly-average status indicators derived from aggregated entries, and a 14-day drinks bar chart.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-16",
      "title": "Dynamic sober-days target derived from onboarding sobriety duration",
      "synonyms": [
        "SoberDaysSection target",
        "sobrietyDuration parsing"
      ],
      "description": "Parses the user’s onboarding sobrietyDuration (e.g., “2 days”, “1 week”, “1 month”) into a numeric day target for the dashboard, with a fallback of 30 days.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-17",
      "title": "Global error boundary and resilient loading fallbacks",
      "synonyms": [
        "GlobalErrorBoundary",
        "black-screen prevention",
        "recovery screen"
      ],
      "description": "Wraps the application routes in a React error boundary that logs uncaught errors and shows a user-facing recovery screen with a reload button; includes robust loading/timeout fallbacks during authentication, actor initialization, and status resolution.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-18",
      "title": "Logout clears identity and client-side caches",
      "synonyms": [
        "logout",
        "clear session",
        "query cache reset"
      ],
      "description": "Logout calls Internet Identity logout/clear and clears the React Query cache to remove user-specific data from the client state.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-19",
      "title": "Neon/brutalist design system and reusable UI primitives",
      "synonyms": [
        "Tailwind OKLCH theme",
        "shadcn UI",
        "brutal-card utilities"
      ],
      "description": "Implements a consistent dark neon/brutalist theme using OKLCH CSS variables, Tailwind extensions (shadows/animations), and reusable UI primitives (Dialog, Card, Button) across login, onboarding, dialogs, and dashboard.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "feature-update-the-frontend-fallback-brutal-message-list-used-by-the-motivation-dialog-so-it-includes-the-same-expanded-quote-pool-including-the-30-new-quotes-to-keep-the-ui-consistent-when-a-backend-message-is-missing-empty",
      "title": "Update the frontend fallback brutal message list used by the motivation dialog so it includes the same expanded quote pool (including the 30+ new quotes) to keep the UI consistent when a backend message is missing/empty.",
      "reqIds": [
        "REQ-2"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Add at least 30 new \"Need Motivation\" brutal-friend motivational quotes referencing onboarding/context (ageRange, secondarySubstance incl. games/porn, motivation lens such as family/health/sport), for use via feedbackMatrix selection.",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-2",
      "summary": "Add at least 30 NEW motivational/brutal-friend quotes (in English) that are cheeky, fun, brutally friendly, and honest, and that explicitly reference: age (age range), other drugs/habits including games and porn, family, health, and sports performance. These quotes must be appended to the existing quote pool used by the backend motivation/feedback message generator.",
      "reqIds": [
        "REQ-1"
      ],
      "status": "pending"
    }
  ],
  "architectural_notes": [
    "Frontend is a React SPA using TanStack React Query for typed data fetching, caching, retries (exponential backoff), and mutation-driven query invalidation.",
    "Authentication is handled via Internet Identity using @dfinity/auth-client, exposed through a React context hook with login lifecycle state.",
    "ICP backend communication is via a generated canister actor created in a custom hook (useActor) and cached in React Query keyed by principal.",
    "Actor initialization calls a canister bootstrap method to assign roles (admin/user) using a secret token flow.",
    "Backend is a Motoko canister with an authorization mixin (MixinAuthorization) built on an AccessControl module (role-based permissions).",
    "User check-ins are normalized into day buckets using a fixed 6-hour offset before flooring to day boundaries; frontend charts/status cards replicate this normalization for alignment.",
    "UI is built with Tailwind CSS + shadcn/Radix-style components, using OKLCH CSS variables, neon glow utilities, and brutalist card styling.",
    "A global React Error Boundary wraps the app to prevent blank screens on uncaught render/runtime errors and provides a reload recovery UI."
  ],
  "known_issues": [
    "Backend state is not upgrade-stable: userProfiles and access-control role mappings are stored in in-memory Maps/vars with no stable serialization, so data will be lost on canister upgrade/reinstall.",
    "Time zone handling is inconsistent: onboarding stores a timeZone string, but day bucketing uses a hardcoded 6-hour offset and does not apply the stored time zone or DST rules.",
    "saveCallerUserProfile overwrites/initializes persistent fields (notably aggregatedEntries) which will erase prior tracking history if the profile is saved again after check-ins exist.",
    "checkOnboardingAndCheckInStatus uses currentDayCheckInStatus as if it indicates sobriety (lastLoginWasSober), but the backend sets currentDayCheckInStatus to ?true on check-in; it is never set to ?false, so “lastLoginWasSober” is misleading/incorrect.",
    "Follow-up flow is logically incomplete: backend sets needsFollowUp for any same-day login after a check-in, and the frontend “Remained sober” action does not update backend state, so follow-ups can reappear the same day across sessions.",
    "getMotivationMessage creates an implicit profile when none exists and sets lastCheckInDate/currentDayCheckInStatus, which can incorrectly affect daily check-in gating for new users.",
    "Unauthenticated/anonymous actor usage can still trigger authorized queries (e.g., status) because the actor exists even when not logged in; backend traps for non-#user callers, potentially causing noisy errors/toasts unless additionally gated by authentication.",
    "_initializeAccessControlWithSecret traps if CAFFEINE_ADMIN_TOKEN is not set in the canister environment, which can prevent all authenticated actor initialization in misconfigured deployments.",
    "submitFollowUpCheckIn does not update currentDayTotalDrinks, so returned/derived totals may be inconsistent with aggregatedEntries.",
    "getProgressMetrics returns last14Days as a slice of the full entries array (not actually limited to 14 days), which can inflate payload size and mismatch UI expectations.",
    "Brutal-friend “randomness” is time-derived and predictable; the condition parameter is currently ignored in message selection.",
    "CycleWindowCard uses a hardcoded 2026 full-moon table but constructs dates using the current year, producing incorrect results outside that dataset.",
    "ChanceOfDrinkingCard is placeholder logic (randomized) and not based on real user behavior.",
    "Motivation click limits are enforced in the backend, but the frontend also keeps a local remaining-clicks counter that can become out of sync on refresh or multi-device use."
  ],
  "isFixRequest": false,
  "gameProjectType": "none",
  "projectName": "BRUTAL - Sobriety Tracking",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}